{
  "chunk-783aeb085fd9ec4000fb4e98814bae09": {
    "content": "# General Specification for Building 2022 Edition  \n\n# SECTION 2  \n\n# DEMOLITION, SITE CLEARANCE AND ALTERATIONS  \n\nRegulations, Ordinances, Codes of Practice & Practice Notes  \n\nComply with all relevant legislation, Codes of Practice and Practice Notes. Particular attention is drawn to the following:  \n\n(a) Code of Practice for Demolition of Buildings issued by the Buildings Department.   \n\n(b) Code of Practice for Site Supervision and Technical Memorandum for Supervision Plans issued by the Buildings Department.   \n\n(c) Guidelines for Selective Demolition and On Site Sorting issued by the Civil Engineering and Development Department.   \n\n(d) Building (Demolition Works) Regulations.   \n\n(e) Building (Administration) Regulations.   \n\n(f) Construction Sites (Safety) Regulations.   \n\n(g) Noise Control Ordinance.   \n\n(h) Air Pollution Control Ordinance.   \n\n(i) Water Pollution Control Ordinance.   \n\n() Factories and Industrial Undertakings Ordinance.   \n\n(k) Factories and Industrial Undertakings (Lifting Appliances and Lifting Gear) Regulations.   \n\n(1) Factories and Industrial Undertakings (Noise at Work) Regulations.   \n\n(m) Factories and Industrial Undertakings (Safety Officers and Safety Supervisors) Regulations.   \n\n(n) Air Pollution Control (Construction Dust) Regulation.   \n\n(0) Noise Control (Construction Work) Regulation.   \n\n(p) The prevailing Buildings Department's Practice Notes for Authorized Persons, . Registered  Structural Engineers and",
    "source_id": "chunk_0",
    "tokens": 292,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_0",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-2911776e5016da7f53d0e9c396a3b405": {
    "content": "visors) Regulations.   \n\n(n) Air Pollution Control (Construction Dust) Regulation.   \n\n(0) Noise Control (Construction Work) Regulation.   \n\n(p) The prevailing Buildings Department's Practice Notes for Authorized Persons, . Registered  Structural Engineers and  Registered Geotechnical Engineers.   \n\n(q) The prevailing Buildings Department's Practice Notes for Registered Contractors.  \n\n# GENERAL REQUIREMENTS FOR DEMOLITION  \n\n2.2 Specialist \n\n2.3 Contractor for Demolition Registered Structural Engineer  \n\nThe demolition works shall be carried out by a Registered Specialist Contractor for Demolition (RSC) on the Specialist Contractor's list maintained by the Buildings Department.  \n\nThe Contractor shall appoint a Registered Structural Engineer (RSE) registered under the Buildings Ordinance for the preparation and endorsement of the method statements, with drawings and design calculations, Supervision Plan for the Contractor's Stream and any other submissions as required by the SO. The duties and roles of the RSE should include but not limited to:  \n\n(a) Take up the full design responsibility for method statements and all related drawings and calculations.   \n\n(b) Assume the role of Authorized Signatory's Representative in the Contractor's Stream under the Supervision Plan.   \n\n(c) Check that assumptions made in the design of temporary works and method statements are validated on the Site.   \n\n(d) Prepare a risk assessment report with the Safety Officer including an inspection schedule for all staff such as RSE, site engineer, Safety Officer, site agent",
    "source_id": "chunk_1",
    "tokens": 291,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_1",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-785213375be8ed6b8c30095cafddd4b5": {
    "content": "that assumptions made in the design of temporary works and method statements are validated on the Site.   \n\n(d) Prepare a risk assessment report with the Safety Officer including an inspection schedule for all staff such as RSE, site engineer, Safety Officer, site agent, site supervisor / foreman, etc. on all critical activities in demolition works.   \n\n(e) Pay such periodical supervision and make such inspections as may be necessary for proper control of the works and submit reports after each visit to certify the work is safe.   \n\n(f) Carry out inspections on other activities which, in his/her professional judgement, are critical and require close supervision.   \n\n(g) Should there be any formation and/or alteration to any slopes, retaining walls and other geotechnical features as a result of the demolition works in the vicinity of the works sites which require geotechnical submissions under current statutory requirements, the RSE shall be responsible to arrange a Registered Geotechnical Engineer (RGE) for all necessary geotechnical submissions to the Geotechnical Engineering Office (GEO) as stipulated in DEVB Technical Circular and other relevant authorities for comments and approval prior to demolition of any structure in the vicinity of the affected slopes, retaining walls and other geotechnical features. All geotechnical submissions shall be prepared by the RGE who shall be under direct supervision of the RSE. The RGE shall also be required to update the slope registrations and Maintenance Manuals to all affected slopes, retaining walls and other geotechnical features with GEO where necessary.",
    "source_id": "chunk_2",
    "tokens": 304,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_2",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-bd541d1ecb91f59f2f9a6f1ff4a7d29a": {
    "content": "the RGE who shall be under direct supervision of the RSE. The RGE shall also be required to update the slope registrations and Maintenance Manuals to all affected slopes, retaining walls and other geotechnical features with GEO where necessary. The RSE shall ensure that all geotechnical submissions and site supervisions are made in accordance with all current statutory requirements of GEO and are acceptable to the relevant checking divisions ofGEO.  \n\n(h) Change of the RSE shall not be permitted without prior written consent of the SO. In case of change of RSE, the new RSE shall review and resubmit the method statements prepared by the former RSE and assume the role of Authorized Signatory's Representative in the Contractor's Stream under Supervision Plan.  \n\n# SUBMISSION REQUIREMENTS FOR DEMOLITION  \n\n# Submission of 2.4 Documents  \n\nSubmission of documents for the SO's approval shall be two months before commencement of demolition works or other specified period. The documents shall include, inter alia, the following:  \n\n(a) Demolition Plans and Stability Report including calculation, and Method Statements.   \n\n(b) Project Safety Plan and the associated Risk Assessment Report.   \n\n(c) Supervision Plan.   \n\n(d) Environmental Management Plan.   \n\n(e) Details of hoardings, covered walkways, catch platforms, catchfans and all necessary precautionary measures in accordance with the Code of Practice for Demolition of Buildings issued by the Buildings Department.   \n\n(f) Mechanical plant and equipment",
    "source_id": "chunk_3",
    "tokens": 296,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_3",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-9efd86e3d2dbb9ad5b1dc41a3dfec1e4": {
    "content": "(e) Details of hoardings, covered walkways, catch platforms, catchfans and all necessary precautionary measures in accordance with the Code of Practice for Demolition of Buildings issued by the Buildings Department.   \n\n(f) Mechanical plant and equipment list.   \n\n(g) Details of supervisory staff.  \n\nAll the above plans and reports shall be prepared in accordance with the requirements of the Code of Practice for Demolition of Buildings. Items (a) to (e) shall be prepared and certified by the RSE.  \n\nProposals for 2.4A Specific Items and Critical Areas  \n\nPay particular attention to detailed proposals for the demolition of the specific items and critical areas that may impact on the general safety of the public and on site personnel, including but not limited to:  \n\n(a) Cantilevered canopies and balconies.   \n\n(b) External wall, parapet and features.   \n\n(c) Scaffolding systems with more than $1.5\\mathrm{m}$ projection.   \n\n(d) Any other structures as stated in the drawings or directed by the SO.  \n\nDemolition Plan and 2.5 Method Statement  \n\nPrepare a Demolition Plan and Stability Report including calculation in accordance with the requirements of the Buildings Ordinance, Building (Administration) Regulations, Code of Practice for Demolition of Buildings and the relevant Practice Notes issued by the Buildings Department, and a comprehensive Method Statement prepared and certified by the RSE.  The comprehensive Method Statement of the demolition works shall",
    "source_id": "chunk_4",
    "tokens": 295,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_4",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-8e04c7854adfd102116b29333c9b413b": {
    "content": "Building (Administration) Regulations, Code of Practice for Demolition of Buildings and the relevant Practice Notes issued by the Buildings Department, and a comprehensive Method Statement prepared and certified by the RSE.  The comprehensive Method Statement of the demolition works shall include but not limited to the following details:  \n\n(a) A scaled plan showing the locations of the structures to be demolished and their distances to the adjacent buildings, structures, streets and significant street furniture. The plan should also show the location of the site video cameras as stipulated in Clause 2.11.The plan should be fully dimensioned with levels and provide sections where appropriate. If possible, site photographs should be included as much as possible.   \n\n(b) An appraisal of the structures to be demolished including an assessment on the structural condition of the part of the structures that are relevant to the demolition works, site condition and adjacent properties.  Any potential hazard that may be associated with the proposed demolition works should be included.   \n\n(C) A description of the proposed methods used to demolish the different parts of the structure. This should include descriptions of the equipment used, the schedule, sequence and proposed procedures for the demolition. Detailed instructions for demolishing special features and critical areas that may affect the safety of the public and on-site personnel should be included. Specific precautionary steps for identifying these features should also be included. The use of graphics could be particularly useful to convey the message.   \n\n(d) The method statement shall include the specification and details for precautionary",
    "source_id": "chunk_5",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_5",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-dff7a61cbc6ec1899bd4bd83d25e0011": {
    "content": "public and on-site personnel should be included. Specific precautionary steps for identifying these features should also be included. The use of graphics could be particularly useful to convey the message.   \n\n(d) The method statement shall include the specification and details for precautionary measures, which are essential to safety. The type of precautionary features should meet the requirement of the demolition method selected and the site conditions. These features should include scaffolds, catch platform, temporary supporting systems to the part of the structure to be demolished and bracing for weakened structural elements.   \n\n(e) A proposed plan for conveyance of debris, on-site management and offsite transportation of the debris. Anticipated traffic condition should also be discussed to allow better planning for off-site transportation. On-site storage of debris shall be specified.  \n\n(f) The method statement shall include detailed plan for removal and disposal of on-site hazardous materials, if any, and disposal in compliance with the environmental protection regulations.   \n\n(g) Access route for handling emergency situations, such as accident, should be provided.   \n\n(h) Inspection and maintenance frequency for the precautionary measures and on site equipment should be included.   \n\n(i) The method statement shall also include the storage and handling of flammable materials that would be used in the demolition process.   \n\n(i A suggested scheme of on-site supervision and technical support for ensuring all works are carried out safely.   \n\n(k) Means to reduce dust, noise and vibration impacts.   \n\n(1) Stability checking calculations for the building to be demolished",
    "source_id": "chunk_6",
    "tokens": 302,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_6",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-70e2da6b6ebd55463b69a69911621d9e": {
    "content": "demolition process.   \n\n(i A suggested scheme of on-site supervision and technical support for ensuring all works are carried out safely.   \n\n(k) Means to reduce dust, noise and vibration impacts.   \n\n(1) Stability checking calculations for the building to be demolished, its supports, if any, the adjoining properties and the loading due to powered mechanical plants, or equipment.   \n\n(m) Detailed design for temporary supporting systems to support machines working on the building and protection of any structure that may be affected by the demolition.   \n\n(n) Periodic inspection schedule on adjacent structures that would potentially be affected by the demolition to evaluate their structural conditions.   \n\n(0) If the project required temporary closure of traffic, a traffic plan with detailed locations of the temporary traffic sign.  \n\n# STAFF REQUIREMENTS FOR DEMOLITION  \n\nTechnically Competent Persons 2.6  \n\nEmploy such number of technically competent persons (TCP) for the demolition works as required. The TCP should have obtained the required qualification (a relevant certificate, diploma, degree or registered professional engineer) and experience in the structural, civil or building discipline and have at least the number of years of relevant site experience in accordance with the Technical Memorandum for Supervision Plans and Code of Practice for Site Supervision issued by the Buildings Department.  \n\nThe TCP(s) shall prepare daily site supervision reports to be endorsed by the RSE.  \n\nSite Engineer 2.7  \n\nEmploy a site engineer, who shall be a Registered Professional Engineer in the structural, civil or building discipline with",
    "source_id": "chunk_7",
    "tokens": 304,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_7",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-97c99c08bce9550a666974ff3442262a": {
    "content": "The TCP(s) shall prepare daily site supervision reports to be endorsed by the RSE.  \n\nSite Engineer 2.7  \n\nEmploy a site engineer, who shall be a Registered Professional Engineer in the structural, civil or building discipline with at least 5 years relevant experience. Submit the particulars of the site engineer, including name, qualification and previous experience, to the SO for approval within 7 days after commencement of thecontract.  \n\nThe site engineer shall conduct full time site supervision, oversee the entire process of the demolition works and prepare site supervision reports at each of the following stages. Such report should be submitted to the SO after completion of each stage of demolition works and before the commencement of the next stage of demolition works. These stages shall include:  \n\n(a) When all site preparation works, including hoardings, covered walkway, scaffolding, catchfans, protective screens and safety nets, dust screens, catch platforms, safety barriers have been erected;  \n\n(b) When all temporary works for demolition of a particular structure have been erected prior to actual demolition; and   \n\n(C) At any stages identified by the SO as critical stage from the Demolition Plan submitted by the Contractor.  \n\nRegistered 2.8 Electrical Worker  \n\nAppoint a relevant registered electrical worker of appropriate trade to certify that the structures have been appropriately electrically disconnected from all electricity supplies and the supply company's incoming supply connected to the structures has been de-energized.",
    "source_id": "chunk_8",
    "tokens": 286,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_8",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-55559d0356a7d92bf729c61fb1696987": {
    "content": "Appoint a relevant registered electrical worker of appropriate trade to certify that the structures have been appropriately electrically disconnected from all electricity supplies and the supply company's incoming supply connected to the structures has been de-energized. The appointed Registered Electrical Worker shall supervise and certify all electrical works to meet the relevant regulations during the contract.  \n\n2.9 Operator of Powered Mechanical Plant or Equipment  \n\nOperator of powered mechanical plant or equipment used in demolition works shall be in compliance with Regulation 9(3) of the Building (Demolition Works) Regulations; and shall have at least 3 years experience in operating the particular plant or equipment. The operator shall also have completed a training course in \"Demolition of Building Course for Plant Operators” organized by the Hong Kong Institute of Construction (HKIC) and obtained the relevant certificate or other equivalent training and certificate issued by a recognized examining body; and operate under the immediate supervision of a TCP of the demolition works.  \n\nSubmit the personal particulars, qualifications and experience of the operators of powered mechanical plant or equipment proposed to be used in the demolition works in accordance with Regulation 31 of the Building (Administration) Regulations, to the SO before the commencement of the demolition works. The Contractor shall notify the SO within 7 days of any change in the appointment of the operator and provide personal particulars, qualifications and experience of the new operator.  \n\n# Demolition Workers 2.10  \n\nEmploy workmen who shall be registered demolition workers",
    "source_id": "chunk_9",
    "tokens": 289,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_9",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-f16e2688c72ad257d4944908fb717128": {
    "content": "shall notify the SO within 7 days of any change in the appointment of the operator and provide personal particulars, qualifications and experience of the newoperator.  \n\n# Demolition Workers 2.10  \n\nEmploy workmen who shall be registered demolition workers or registered worker of appropriate trades and under supervision of a TCP. These demolition workers shall have attended the Safety Training Course for Construction Workers of Specified Trades (the “Silver Card\" course) organized by HKIC for demolition works, and possessed the relevant valid silver card issued by HKIC. All workers involved in the demolition works should also have received other relevant safety trainings such as proper procedure for the use of PPE, working at height safety, etc.  \n\n# VIDEO RECORDING SYSTEM FOR DEMOLITION  \n\n# Video Recording 2.11 System  \n\nProvide and maintain two colour video cameras for each building with resolution not less than $1920~\\mathrm{~x~}~1080$ and with appropriate view angle coverage, light sensitivity and automatic focus and aperture, TV monitors and video recording systems, and with all necessary accessories including the recording media for transmitting and recording, to capture the entire demolition process. The video recording systems and video records shall be kept in a secured place to be agreed with the SO. The video signals from the cameras shall also be real-time connected or transmitted to the site office of the SO and be viewed and inspected by the SO with a TV monitor, equipped with switching system to each camera. The video cameras shall",
    "source_id": "chunk_10",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_10",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-c44497625e56d24c57e76ee5e30a5948": {
    "content": "with the SO. The video signals from the cameras shall also be real-time connected or transmitted to the site office of the SO and be viewed and inspected by the SO with a TV monitor, equipped with switching system to each camera. The video cameras shall be installed at strategic locations as directed by the SO and be securely protected so that the entire demolition process including the movement of debris and the overall sequence of demolition can be captured. The video records shall be kept for inspection for at least 14 days.  Post sufficient notices at conspicuous positions to notify the affected persons including the workers, the staff and the general public about the purpose of video recording system in accordance with Data Protection Principles set out in the Personal Data (Privacy) Ordinance.  \n\n# ENVIRONMENTAL CONTROL DURING DEMOLITION  \n\n# Noise Level Control 2.12  \n\nThe noise level generated from the works site and measured at the nearby noise sensitive receivers shall not exceed the limits as specified.  \n\nProvide all necessary equipment and labour to monitor and to record the noise levels measured at the nearby premises and any other locations to be agreed by the SO at least twice daily and any other time when required by the SO.  The monitoring records of the noise measurements shall be kept on site for the SO's inspection.  \n\nWater Pollution 2.13 Control  \n\nProvide, operate and maintain all necessary water pollution control system on site and plan the works such that discharge and deposit of effluents generated from the demolition operations shall be controlled as specified.",
    "source_id": "chunk_11",
    "tokens": 302,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_11",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-f72a1ef40d59edc620fbc0379d4139ef": {
    "content": "SO's inspection.  \n\nWater Pollution 2.13 Control  \n\nProvide, operate and maintain all necessary water pollution control system on site and plan the works such that discharge and deposit of effluents generated from the demolition operations shall be controlled as specified.  \n\nAir Pollution Control  \n\n2.14  \n\nProvide, operate and maintain all necessary air pollution control system on site and plan the works to minimize generation of dust and to minimize the spread of dust to beyond the Site.  \n\n# Coordination with neighbour  \n\n# 2.15  \n\nAdopt demolition operation that produces the least loud noise or dust nuisance to occupants of the surrounding buildings. Co-ordinate with the management of the neighbouring premises and all other concerned parties with report to the SO, and schedule the works to suit those hours that will cause the least disturbance.  \n\n# PROTECTIONOFADJACENTPROPERTIESDURINGDEMOLITION  \n\nProtection to adjacent buildings and structures  \n\n# 2.16  \n\nProvide adequate support and protection to adjacent buildings and structures, pedestrian subways, building services installations including all underground cables and pipe works within or in the vicinity of the Site.  \n\nAny area, if unduly damaged, shall be restored and made good to its original conditions at the expense of the Contractor.  \n\n# METHODS OF DEMOLITION  \n\nTop Down Method 2.17  \n\nTop down method shall be adopted unless specified otherwise.  \n\nHydraulic Concrete Crusher and Concrete Breaker  \n\nHydraulic Concrete Crusher shall be used for",
    "source_id": "chunk_12",
    "tokens": 296,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_12",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-eb3d2e90a10fd8b9f51ed18b47f92959": {
    "content": "of the Contractor.  \n\n# METHODS OF DEMOLITION  \n\nTop Down Method 2.17  \n\nTop down method shall be adopted unless specified otherwise.  \n\nHydraulic Concrete Crusher and Concrete Breaker  \n\nHydraulic Concrete Crusher shall be used for demolition of reinforced concrete structures unless otherwise approved by the SO.  \n\nUnless specified otherwise, the use of percussive type of concrete breaker is allowed during part of the demolition process. Submit proposal on limiting the noise generation for the SO's approval. Subject to the approval by the Environmental Protection Department on noise permit, the time allowed for using any percussive type of concrete breaker shall be agreed by the SO.  \n\nWrecking Ball 2.19  \n\nThe use of swinging ball, drop ball and blasting shall not be permitted for demolition works.  \n\n# Saw Cut Method 2.20  \n\nTo isolate the vibration and noise generated during demolition being transmitted to the adjacent premises adjacent to the Site, the Contractor can use Saw-Cut method or other approved methods to separate the structures to be demolished from the structures to be retained before demolition. Submit method statement for forming such separation joints, including temporary support and shoring, for the SO's approval.  \n\n# DISPOSAL OFDEMOLITION WASTEDURINGDEMOLITION  \n\nRemoval of 2.21 Demolition Waste  \n\nExcept otherwise directed, all salvage materials become the property of the Contractor and shall be removed from the Site expeditiously as the works proceed. The storage",
    "source_id": "chunk_13",
    "tokens": 296,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_13",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-7ff2f01eec6320b62f16aa1134126d1f": {
    "content": "WASTEDURINGDEMOLITION  \n\nRemoval of 2.21 Demolition Waste  \n\nExcept otherwise directed, all salvage materials become the property of the Contractor and shall be removed from the Site expeditiously as the works proceed. The storage, segregation and disposal of demolition waste shall be in accordance with the guidelines stipulated in the “Guidelines for Selective Demolition and On-Site Sorting” and the contract requirements. The handling of demolition waste shall follow in the Environmental Management Plan prepared by the Contractor.  \n\nA complete record is required to be kept on site and regularly updated on the disposal, reuse and recycling of all demolition waste with respect to their dates of  \n\ndisposal and the quantities involved.  \n\nAll hazardous waste discovered shall be handled by licensed contractor registered in the Environmental Protection Department listing and approved by the SO.  \n\n# Environmental 2.22 Management Plan  \n\nEnvironmental Management Plan shall, in conjunction with the Demolition Plan, provide all necessary details including but not limited to the following:  \n\n(a) Method of handling demolished building debris.   \n\n(b) Routing and movement of debris from each floor to on grade holding area prior to leaving the Site.   \n\n(c) Means of transportation of debris off the Site.   \n\n(d) Time and frequency of debris disposal off site.   \n\n(e) Record scheme on the tonnage of each truck load, truck licence plate, driver's name, trip tickets and location of dump site.   \n\n(f) The site supervisory personnel responsible for the debris disposal",
    "source_id": "chunk_14",
    "tokens": 297,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_14",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-19602a2019472b3172b05268cc14b336": {
    "content": "and frequency of debris disposal off site.   \n\n(e) Record scheme on the tonnage of each truck load, truck licence plate, driver's name, trip tickets and location of dump site.   \n\n(f) The site supervisory personnel responsible for the debris disposal and management system.  \n\n2.23  \n\nDisposal of   \n\nConstruction &   \n\nDemolition (C&D) Materials  \n\nDisposal of C&D materials shall comply with the “Particular Specification on Environmental Management”’ and the “Waste Disposal (Charges for Disposal of Construction Waste) Regulation\" currently enforced.  \n\n# CERTIFICATIONANDSUBMISSION UPON COMPLETION OF DEMOLITION  \n\nCertification 2.24  \n\nUpon completion of the demolition works, the Contractor shall certify the completion of the demolition works in accordance with the Buildings Ordinance, Regulations and the Demolition Plan. The certification shall be endorsed by the RSE.  \n\n# As-built Records 2.25  \n\nProvide a complete list of as-built drawings with drawing number / reference and brief description stored in computer diskettes. The drawings shall show the final boundary of the Site with fencing, ground features, levels and as-built external storm water drains, where the surface water is connected to the storm water drainage system outside the Site.  \n\n# PRELIMINARY WORKS AND PRECAUTIONARY MEASURES FOR DEMOLITION, SITE CLEARANCE ANDALTERATIONS  \n\nSurvey 2.26  \n\nCarry out detailed survey including existing services",
    "source_id": "chunk_15",
    "tokens": 289,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_15",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-72a191ab9045ad501e69b60a15c0c6d9": {
    "content": "water drainage system outside the Site.  \n\n# PRELIMINARY WORKS AND PRECAUTIONARY MEASURES FOR DEMOLITION, SITE CLEARANCE ANDALTERATIONS  \n\nSurvey 2.26  \n\nCarry out detailed survey including existing services, drainage systems and building services installations.  \n\n2.27  \n\nBuilding Services and Drainage System  \n\nThe Contractor shall appoint a Building Services Coordinator to liaise and coordinate decommissioning of existing building services installations.  The Building Services Coordinator shall have a diploma or higher certificate in building services, electrical or mechanical engineering from a recognized tertiary in Hong Kong or equivalent and have at least 5 years experience in building services installations of which at least 2 years experience shall be in building services coOrdination.  \n\nEnsure all existing water supplies, drainage and building services provisions of adjacent buildings and areas will not be affected.  \n\nReport to the SO for directions upon discovery of any previously hidden or unidentified services/cables. Any unknown cables / pipes so discovered shall be carefully exposed by hand tools or as directed by the SO.  \n\nProvide all temporary water supplies and drainage connections to any adjacent buildings affected prior to disconnecting the existing supplies in the buildings.  \n\nCoordinate all utility companies and organizations such as power supply companies, telecommunications network services operators, town gas supply company, liquefied petroleum gas supply company and Water Supplies Department and other parties appointed by the SO to carry out disconnection, diversion, relocation or removal of their equipment and installations.  \n\nPreliminary Works",
    "source_id": "chunk_16",
    "tokens": 297,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_16",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-9a641272664cae48a1dbfc2f971e844f": {
    "content": "telecommunications network services operators, town gas supply company, liquefied petroleum gas supply company and Water Supplies Department and other parties appointed by the SO to carry out disconnection, diversion, relocation or removal of their equipment and installations.  \n\nPreliminary Works 2.28  \n\nSeal all abandoned sewer and drainage connections of the existing manholes and associated underground drain pipes as directed by the SO.  \n\nRemove all glazed sashes and doors from the relevant parts of the structures.  \n\nRemove all hazardous materials including asbestos.  \n\nDisplace the trapped gas within all town gas systems and liquefied petroleum gas systems and certify that they are free of combustible gas in accordance with the Regulation and requirements specified by the authorities.  \n\n# Precautionary Measures  \n\n2.29  \n\nThe necessary precautionary measures shall comply with the requirements in Clause 2.1 including but not limited to the following:  \n\n(a) Erection of hoarding, covered walkway and catch platform including temporary lighting according to drawings.   \n\n(b) Design and erection of scaffoldings, screen covers and catchfans.   \n\n(c) Design and erection of temporary supports to the elements of structure to be demolished, in particular, the cantilevered canopies and covered walkway and the external parapet wall and features and other elements as specified by the SO.   \n\n(d) Protection of adjacent properties, structures and services.   \n\n(e) Use of tarpaulin material as specified by the SO.   \n\n() Provide precautionary measures for disused",
    "source_id": "chunk_17",
    "tokens": 296,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_17",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-20f8ac591346e9b1eb004fa2400a0cf5": {
    "content": "parapet wall and features and other elements as specified by the SO.   \n\n(d) Protection of adjacent properties, structures and services.   \n\n(e) Use of tarpaulin material as specified by the SO.   \n\n() Provide precautionary measures for disused manholes and underground voids.   \n\nCertification of 2.30   \n\nPrecautionary   \n\nMeasures  \n\nUpon completion of the precautionary works, including hoarding, covered walkway, scaffolding, catchfans, protective screens and safety nets, dust screens, catch platform, safety barrier, and the like, the Contractor shall certify the completion of the precautionary works in accordance with the provisions of the Buildings Ordinance, Regulations and Demolition Plan. The certification shall be endorsedbytheRSE.  \n\nPost-Demolition 2.31 Precautions  \n\nAfter completion of demolition, reinstate the Site to the conditions as shown in drawings. Unless specified otherwise, the following precautionary measures shall be adopted:  \n\n(a) The Site shall be levelled and cleared of any debris. Adequate drainage shall be provided.   \n\n(b) If the new development is not immediately commenced, the Site shall be completely enclosed as shown in drawings.   \n\n(c) Provide supports to adjacent building structures, weather-proofing and stabilization of exposed party walls shall be completed. A final inspection by RSE on the supports of adjacent structures shall be conducted to ensure satisfactory and safe conditions. If temporary shoring remains on site, inspection and maintenance shall be continued until",
    "source_id": "chunk_18",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_18",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-5b532418a0989d3c57973831af79d3a1": {
    "content": "weather-proofing and stabilization of exposed party walls shall be completed. A final inspection by RSE on the supports of adjacent structures shall be conducted to ensure satisfactory and safe conditions. If temporary shoring remains on site, inspection and maintenance shall be continued until the temporary shoring is removed or replaced by permanent supports.  \n\n(d) Any excavation shall be braced and stabilized. (e) For sloping sites, and/or sites with retaining wall supporting ground, the following additional precautionary measures shall be included:  \n\n(i) The ground surface shall be sealed up to prevent water infiltration.   \n\n(i) Any unstable structures and ground shall be stabilized.  \n\n# SAFETY MEASURES FOR DEMOLITION, SITE CLEARANCE AND ALTERATIONS  \n\nHoarding and Covered Walkway  \n\n2.32  \n\nProvide and maintain the hoardings and covered walkways as shown on the drawings.  \n\nSafety Protection 2.33  \n\nProvide and erect necessary and sufficient safety protection such as scaffolding, catchfans, protective screens and safety nets, dust screens, catch platforms, safety barriers, additional hoardings and covered walkways etc. for the safety and convenience of traffic, passers-by, users of adjacent premises, or workmen employed on the Works. All safety protection shall be erected prior to the commencement of the demolition operation and shall be maintained in good conditions until the completion of the demolition works. Regular inspection and clearance of debris shall be carried out.  \n\n# Fire or Explosion  \n\n2.",
    "source_id": "chunk_19",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_19",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-e143679d4bc425d731c34c658b188a5a": {
    "content": ". All safety protection shall be erected prior to the commencement of the demolition operation and shall be maintained in good conditions until the completion of the demolition works. Regular inspection and clearance of debris shall be carried out.  \n\n# Fire or Explosion  \n\n2.34  \n\nTake precautions to prevent fire or explosion caused by gas, vapour, electricity or any other source. Take appropriate precautions when removing tanks or pipes which may have contained flammable liquids or gases.  \n\n# Disused drain  \n\n2.35  \n\nTake care to allow disused drains to vent built-up gas before allowing workmen to carry out works below ground level.  \n\nUnderground voids  \n\n# 2.36  \n\nProvide vent pipes to underground tanks to vent built-up gases and vapours.  \n\n# TREE PRESERVATION AND PROTECTION FOR DEMOLITION, SITE CLEARANCE AND ALTERATIONS  \n\n# Precautions generally  \n\n2.37  \n\nThe Contractor shall comply with the requirements in Clauses 25.201 to 25.257 on tree preservation and protection to ensure that the demolition, site clearance and alteration works will not damage the preserved trees. Regular cleansing to keep off dust accumulation on foliage; and works to the satisfaction of the SO.  \n\nPrecautions prior to 2.38   \n\ndemolition, site   \n\nclearance and   \n\nalteration  \n\nThe Contractor shall commence demolition, site clearance and alteration works only after the Contractor's compliance with the requirements stipulated to be completed prior to commencing site clearance, demolition,",
    "source_id": "chunk_20",
    "tokens": 295,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_20",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-817695a4224d89401260f1ceebfb7393": {
    "content": "2.38   \n\ndemolition, site   \n\nclearance and   \n\nalteration  \n\nThe Contractor shall commence demolition, site clearance and alteration works only after the Contractor's compliance with the requirements stipulated to be completed prior to commencing site clearance, demolition, construction of permanent or temporary works, and any other site operations which may affect the trees. These requirements include but are not limited to:  \n\n(a) Installation of tree identification labeling or marking system pursuant to Clause 25.217 (c);   \n\n(b) Agreement of the SO to the limits of site clearance pursuant to Clause 25.218;   \n\n(c) Erection of temporary protective fencing pursuant to Clause 25.233; and   \n\n(d) Erection of temporary protective armouring and application of temporary protective mulching pursuant to Clause 25.238.   \n\nPrecautions during 2.39   \n\ndemolition, site   \n\nclearance and   \n\nalteration  \n\nDuring demolition, site clearance and alteration works, the Contractor shall comply with the requirements on the restrictive use of the preserved trees and their Tree Protection Zones (TPZs) and the control measures for works within the TPZs. These requirements include but are not limited to:  \n\n(a) Restrictive use of the preserved trees and their TPZs pursuant to Clauses 25.223, 25.225,25.226 and 25.228; and   \n\n(b) Control measures for changes in ground levels, excavation including trenching, and drilling within the TPZs pursuant",
    "source_id": "chunk_21",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_21",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-d6d1c10ae5397c2be3c654e69888327c": {
    "content": "their TPZs pursuant to Clauses 25.223, 25.225,25.226 and 25.228; and   \n\n(b) Control measures for changes in ground levels, excavation including trenching, and drilling within the TPZs pursuant to Clauses 25.240 to 25.244.  \n\n# CLEARING WEEDS FOR DEMOLITION, SITE CLEARANCE AND ALTERATIONS  \n\n# Clearing weeds generally  \n\n2.40  \n\nWhen instructed by the SO, the Contractor shall identify any Mikania micrantha as well as any other unwanted plants specified as noxious weeds by the SO and remove these plants from the Site as part of the site clearance work. The Contractor shall comply with the requirements in Clause 25.53 when clearing these unwanted plants.  \n\n# Clearing Mikania 2.41 micrantha  \n\nWhen clearing Mikania micrantha, the Contractor shall follow the technical guidance in the latest version of Nature Conservation Practice Note No. 01 \"Clearing Mikania\"” promulgated by the Agriculture, Fisheries and Conservation Department.  \n\n# ASBESTOS INVESTIGATION, REMOVAL FOR DEMOLITION, SITE CLEARANCE AND ALTERATIONS  \n\nAsbestos containing materials  \n\n2.42  \n\nBefore any demolition or alteration work commences, a registered asbestos consultant shall be appointed to conduct a thorough investigation of the building for the presence of asbestos containing material at the premises and submit an Asbestos Investigation Report and, if asbestos containing",
    "source_id": "chunk_22",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_22",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-d45e511015d76b43f1eed82498152dc6": {
    "content": "2.42  \n\nBefore any demolition or alteration work commences, a registered asbestos consultant shall be appointed to conduct a thorough investigation of the building for the presence of asbestos containing material at the premises and submit an Asbestos Investigation Report and, if asbestos containing material is found, an Asbestos Abatement Plan to the Environmental Protection Department at least 28 days before the asbestos abatement work commences.  \n\nWhen appropriate, a registered asbestos laboratory shall be appointed to carry out sampling, measurement or analysis of any suspected asbestos containing material.  \n\nAsbestos removal works shall be carried out by a registered asbestos contractor under the supervision of a registered asbestos consultant in compliance with relevant legislation and codes of practice.  \n\nIf during the course of the general demolition works, hidden suspected asbestos containing material is found, stop works immediately and report to the SO.  \n\nAsbestos removal  \n\n2.43  \n\nThe removal of asbestos-containing materials shall be carried out by an approved registered asbestos contractor prior to commencement of general demolition works to avoid contamination of debris arising from the demolition.  \n\nSpecified notification forms about the commencement of the asbestos abatement works shall be submitted to the Environmental Protection Department and the Labour Department 28 days in advance.  \n\n# Sampling and analysis  \n\n2.44  \n\nBulk samples of suspected asbestos-containing materials shall be taken on the advice and under the supervision of a registered asbestos consultant and analysed by an approved laboratory to verify the presence of asbestos, and to determine the content and the type of asbestos.  \n\nFull depth of",
    "source_id": "chunk_23",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_23",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-cf2fa1d04b4c721d16625e8956dad707": {
    "content": "ulk samples of suspected asbestos-containing materials shall be taken on the advice and under the supervision of a registered asbestos consultant and analysed by an approved laboratory to verify the presence of asbestos, and to determine the content and the type of asbestos.  \n\nFull depth of the insulation material from its outer surface to the base structure shall be taken for sampling.  \n\nWhen specified, two additional side by side quality control samples shall be taken and analysed by another approved laboratory.  \n\nAsbestos abatement 2.45   \n\nplan and method   \n\nstatement  \n\nWhere an asbestos abatement plan has been prepared as per Clause 2.42, the registered asbestos consultant appointed shall supervise the implementation of the plan. Where the submission of an asbestos abatement plan is not required, the  \n\nContractor shall submit, before commencement of the removal work, a detailed method statement to the SO for approval, which shall include a detailed works programme, sketches showing the containments, air locks, air movers and scaffolding as required. Contingency measures of safety and escape access shall be maintained in case of an emergency (fire, accident, etc.).  \n\nGlove bag method 2.46  \n\nThe use of glove bag method for the removal of asbestos-containing materials shall be included in the asbestos abatement plan with prior approval by the Environmental Protection Department and the SO.  \n\n# Supervisor  \n\nA full time Registered Asbestos Supervisor shall be stationed at the works site.  \n\nWarning signs 2.48  \n\nProper and publicly visible warning signs in compliance",
    "source_id": "chunk_24",
    "tokens": 300,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_24",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-1fc8b4abe43edb781c21154aa6b4b8a7": {
    "content": "abatement plan with prior approval by the Environmental Protection Department and the SO.  \n\n# Supervisor  \n\nA full time Registered Asbestos Supervisor shall be stationed at the works site.  \n\nWarning signs 2.48  \n\nProper and publicly visible warning signs in compliance with relevant legislation and codes of practice shall be provided.  \n\nFloor tile adhesive 2.49 remover  \n\nThe floor tile adhesive remover used in the asbestos vinyl floor removal works shall be the type of low volatile organic compound (VOC) content and shall comply with the following requirements:  \n\n(a) biobased (b) VOC content of less than $5\\%$  \n\nMastic removers made from petroleum-based chemistry are prohibited. The tile adhesive remover shall be acceptable by the Environmental Protection Department of proven safe formula in accordance with the Code of Practice on Asbestos Control.  The application of the tile adhesive remover shall strictly follow the manufacturer's instructions and recommendations.  \n\nAfter removal of tile adhesive, the surface shall be cleaned with an approved degreaser. Only those degreasers recommended by the manufacturer of the tile adhesive remover shall be used for removing the residue remaining on the floor substrate, before laying the new floor tiles.  \n\n# Minimisation of 2.50 fibre release  \n\nFull containment method shall be applied to the removal works of friable asbestos materials. Smoke test shall be conducted by a registered asbestos consultant before the commencement of asbestos removal works to ensure the integrity of the full containment. Sufficient negative pressure shall",
    "source_id": "chunk_25",
    "tokens": 294,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_25",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-1a21f9dcc0fdec2ae6b538d338df7387": {
    "content": "fibre release  \n\nFull containment method shall be applied to the removal works of friable asbestos materials. Smoke test shall be conducted by a registered asbestos consultant before the commencement of asbestos removal works to ensure the integrity of the full containment. Sufficient negative pressure shall be maintained during the removal Works.  \n\nNo power tools shall be used directly on asbestos containing materials.  \n\nAsbestos material shall be wetted prior to stripping / removal and shall be mistsprayed with amended water during stripping.  \n\nBreakage of asbestos material should be minimized during removal works.  \n\nAsbestos waste shall be collected in approved waste containers as soon as it is produced.  \n\nDebris / dust generated shall be removed with high efficiency particulate absolute vacuum cleaner which shall be positioned next to the source of fibre generation.  \n\nWhen entering or leaving the contaminated work area, a strict changing and decontamination routine must be followed by all personnel.  \n\nWaste disposal 2.51  \n\nAsbestos-containing waste generated from the removal works shall be properly disposed of in accordance with the requirements of the Code of Practice on the Handling, Transportation and Disposal of Asbestos Waste published by the Environmental Protection Department.  \n\nNotification shall be given to the Environmental Protection Department at least ten days before the scheduled disposal of asbestos waste and a duly stamped trip ticket shall be submitted to the SO for confirmation of disposal.  \n\nWater contaminated with asbestos shall be filtered first before being discharged into soil drains.  \n\n# Air monitoring  \n\n2.52  \n\nAsbestos removal shall be",
    "source_id": "chunk_26",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_26",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-7086ae1130cddd388e716cd0322b370f": {
    "content": "of asbestos waste and a duly stamped trip ticket shall be submitted to the SO for confirmation of disposal.  \n\nWater contaminated with asbestos shall be filtered first before being discharged into soil drains.  \n\n# Air monitoring  \n\n2.52  \n\nAsbestos removal shall be closely monitored by air sampling and an analysis of the air-borne fibres in conjunction with the removal work undertaken by an approved laboratory.  \n\nPersonal air samples shall be taken for the worker carrying out asbestos removal work. A reading of less than 0.2 fibre/mL shall be required for the removal works of amosite / crocidolite. For removal works of other types of asbestos materials, the reading shall not exceed 0.5 fibre/mL.  \n\nA reading of less than 0.o1 fibre/mL will be required in the penultimate / final clearance / reassurance air sample analysis to ensure the site cleanliness after asbestosremoval works.  \n\nStorage of waste 2.53  \n\nDouble-bagged asbestos waste shall be clearly marked with indelible ink and labeled, and stored either in a designated weatherproof holding area within the Site or in a secured lockable area outside the contaminated works area, with either location to be agreed on site. Conspicuous warning sign in compliance with relevant legislation and codes of practice shall be provided at the storage area.  \n\nRegulations, Ordinances and Codes of Practice (Asbestos)  \n\n2.54  \n\nComply with all relevant legislation and codes of practice in connection with asbestos removal works. Particular attention shall be drawn to",
    "source_id": "chunk_27",
    "tokens": 307,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_27",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-b9ac28d4f681cf6d7723e4d01e9d9505": {
    "content": "shall be provided at the storage area.  \n\nRegulations, Ordinances and Codes of Practice (Asbestos)  \n\n2.54  \n\nComply with all relevant legislation and codes of practice in connection with asbestos removal works. Particular attention shall be drawn to the following:  \n\n(a) Factories and Industrial Undertakings (Asbestos) Regulations.   \n\n(b) Air Pollution Control Ordinance.   \n\n(c) Air Pollution Control (Asbestos) (Administration) Regulations.   \n\n(d) Code of Practice on the Handling, Transportation and Disposal of Asbestos Waste, the Environmental Protection Department.   \n\n(e) Code of Practice on Asbestos Work using Full Containment or Mini Containment Method, the Environment Bureau.   \n\n(f) Code of Practice on Safe Handling of Low Risk Asbestos Containing Material, the Environment Bureau.   \n\n(g) Code of Practice on Asbestos Work using Glove Bag Method, the Environment Bureau.   \n\n(h) Code of Practice - Safety and Health at Work with Asbestos, the Labour Department.   \n\n(i) The prevailing Codes of Practice on asbestos control issued by the Environmental Bureau.  \n\n# SECTION 3  \n\n# EXCAVATION AND EARTHWORK  \n\n# GENERAL  \n\n# Definitions  \n\n3.1  \n\n(a) (i \"Top soil' is soil capable of supporting vegetative growth. (i) \"Inert construction and demolition material' shall mean rock, rubble, earth, soil, concrete, asphalt, brick, tile and masonry generated from construction and demolition works.",
    "source_id": "chunk_28",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_28",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-2743a4261fc677b50f092252556f7033": {
    "content": "\"Top soil' is soil capable of supporting vegetative growth. (i) \"Inert construction and demolition material' shall mean rock, rubble, earth, soil, concrete, asphalt, brick, tile and masonry generated from construction and demolition works.  \n\n(b) \"Suitable material' shall consist of naturally occurring or processed material, or inert construction and demolition material, which at the time of deposition is capable of being compacted in accordance with the specified requirements to form stable areas of fill. The soluble sulphate content of the suitable material placed within $500\\mathrm{mm}$ of concrete, cement bound material or cementitious material shall not exceed $1.9\\mathrm{g}$ of sulphate, expressed as $\\mathrm{SO}_{3}$ per litre. The total sulphate content, expressed as $\\mathrm{SO}_{3}$ ，of the suitable material placed within $500\\mathrm{mm}$ of metal work shall not exceed $0.5\\%$ by mass.  \n\nThe method of testing of the total sulphate content shall be in accordance with Geospec 3 - Model Specification for Soil Testing issued by the Geotechnical Engineering Office.  \n\n(C) \"Unsuitable material’ is material other than suitable material or containing any of the following:  \n\n(i Material susceptible to volume change, including marine mud, soil with a liquid limit exceeding $65\\%$ or a plasticity index exceeding $35\\%$ , swelling clays and collapsible soils.   \n\n(i) Peat, vegetation, timber, organic, soluble",
    "source_id": "chunk_29",
    "tokens": 312,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_29",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-d26d1b05e243ad11433e69b93d8cf1d9": {
    "content": "to volume change, including marine mud, soil with a liquid limit exceeding $65\\%$ or a plasticity index exceeding $35\\%$ , swelling clays and collapsible soils.   \n\n(i) Peat, vegetation, timber, organic, soluble or perishable material.   \n\n(iii) Dangerous or toxic material or material susceptible to combustion.   \n\n(iv) Metal, rubber, plastic or synthetic material.  \n\n(d) “Rock\" is hard material which in the opinion of the SO can only be removed by the use of blasting, wedges or pneumatic drills and shall include individual boulders or other masses exceeding $0.20~\\mathrm{m}^{3}$ in size.  \n\n(e)(i) \"Rock filling material’ shall consist of pieces of concrete or hard and durable rock of which the maximum size shall not be greater than three times the minimum dimension of individual pieces and in the opinion of the SO not more than $30\\%$ by mass is discoloured or shows other evidence of decomposition. (i) “Recycled rock filling material (Grade 200) shall be recycled rock or inert construction and demolition material which is hard and durable, and free from cracks, veins, and other evidence of decomposition.  \n\n(f) Not used.   \n\n(g) \"General filling material’ shall be “suitable material'. It may contain up to $25\\%$ rock distributed evenly throughout the whole mass of the material. General filling material shall contain no material exceeding $200\\mathrm{mm}$ in",
    "source_id": "chunk_30",
    "tokens": 307,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_30",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-42471bad4683044c40250fb42174fdfb": {
    "content": "(g) \"General filling material’ shall be “suitable material'. It may contain up to $25\\%$ rock distributed evenly throughout the whole mass of the material. General filling material shall contain no material exceeding $200\\mathrm{mm}$ in size.   \n\n(h) \"Fine filling material shall be “suitable material capable of passing through a $75\\mathrm{mm}$ BS sieve.   \n\n(i) \"Special filling material shall be “suitable material’ capable of passing through a $75\\mathrm{mm}\\mathrm{BS}$ sieve. The special filling material shall be sampled and tested according to Geospec 3. The special filling material shall have the following characteristics:   \n\n(i) Liquid limit shall not exceed $45\\%$   \n\n(i) Plasticity index shall not exceed $20\\%$   \n\n(i) Coefficient of uniformity shall be greater than 50.   \n\n(iv) The percentage passing a $63~{\\upmu\\mathrm{m}}$ BS sieve shall be less than $45\\%$ by mass.  \n\nG) \"Embankment\", “filling area” or \"“area of fill' means an area on the Site other than a foreshore or sea-bed where the ground level shall be raised by filling in layers as part of the Works.  \n\n(k) \"Trench excavation\" means excavating from ground level not exceeding $5000\\mathrm{mm}$ in width at surface.   \n\n(1) \"Bulk excavation” means excavation in the open other than trench excavation",
    "source_id": "chunk_31",
    "tokens": 313,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_31",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-8fd90e904961e7b4f5ff6baae3a022bd": {
    "content": "(k) \"Trench excavation\" means excavating from ground level not exceeding $5000\\mathrm{mm}$ in width at surface.   \n\n(1) \"Bulk excavation” means excavation in the open other than trench excavation.   \n\n(m) Well-graded material shall consist of material that has a coefficient of uniformity exceeding 10.   \n\n(n) Uniform-graded material shall consist of material that has a coefficient of uniformity of 10 or less.   \n\n(0) The coefficient of uniformity \\left(C_{u}}\\right) shall be calculated as C_{u}=D_{60}/D_{10} where D}_{60 and {\\bf D}_{10 are the equivalent sieve sizes in millimetres, interpolated from the particle size distribution curve, through which 60% and 10% of the filling material would pass respectively.   \n\n(P) The different types of filling material shall have the particle size distributions within the ranges stated in Table 3.1.  \n\nTABLE3.1 Particle size distributions of filling material   \n\nGround investigation  3.2  \n\nGround investigation reports, where these have been prepared, will be made available for inspection at the office of the SO. This information is given in good faith and no warranty whatsoever is given as to its accuracy.  \n\n# Record survey  3.3  \n\nSpot levels and contours shown on drawings are, unless otherwise stated, reduced to principal datum.",
    "source_id": "chunk_32",
    "tokens": 286,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_32",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-213521c8696a75ffb76fcd2b6ec90905": {
    "content": "SO. This information is given in good faith and no warranty whatsoever is given as to its accuracy.  \n\n# Record survey  \n\n3.3  \n\nSpot levels and contours shown on drawings are, unless otherwise stated, reduced to principal datum.  \n\nCheck the accuracy of site levels shown on drawings. Where levels are found to be inaccurate, notify the SO in writing before commencing excavation or earthwork. No claim in respect of inaccuracy of levels will be entertained after the relevant site levels have been altered by the Works.  \n\nWhere specified, make an oversite topographical survey by an approved independent firm included in the current List of Approved Suppliers of Materials and Specialist Contractors for Public Works - Land, Engineering and Hydrographic Survey Services before any work is carried out under the Contract and again, after all excavation and filling work has been completed. If an independent firm is not employed, agree with the SO that plans or sections prepared from the above truly represent the original ground levels and the final levels required by the Contract and ensure that both parties sign the drawings. These endorsed drawings shall become the record surveys for the measurement of earthwork quantities.  \n\nTemporary works 3.4 for earthworks  \n\nDesign the temporary works associated with earthworks, including temporary slopes, stockpiles and drainage, such that the risk of failure is not more than that which would be adopted if the temporary works were to be permanent. Allowance may be made in the design of the temporary works for the shorter design life and for",
    "source_id": "chunk_33",
    "tokens": 297,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_33",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-883c45af2020536a9b0acaaee589dbc6": {
    "content": ", stockpiles and drainage, such that the risk of failure is not more than that which would be adopted if the temporary works were to be permanent. Allowance may be made in the design of the temporary works for the shorter design life and for the risk to persons and property and the surface water and groundwater conditions which may occur during construction.  \n\nThe Contractor shall provide details to the SO to demonstrate that the design of temporary works has been considered and incorporated measures, which minimise excavation of materials.  \n\n# Earthwork 3.5  \n\n(a) Carry out excavation and earthwork in such a manner as to prevent erosion or slips. Limit working faces to safe slopes and height. Do not stockpile material where it might cause a landslide or failure of excavation face.  \n\n(b) Provide and maintain necessary temporary access roads and temporary drainage, and divert and subsequently reinstate permanent drainage systems. Submit proposed alignments and levels of temporary access roads for approval prior to their construction. Provide temporary roads with sufficient drainage ditches over their full length.   \n\n(c) Monitor weather forecasts to ensure awareness of impending heavy rain and inspect the site frequently during periods of sustained rainfall.   \n\n(d) Seal, cover with impermeable sheeting or protect by other methods approved by the SO, all excavation and earthwork at the cessation of the day's work and when heavy rain is expected.   \n\n(e) Material handling and storage areas shall be levelled and well drained. Stockpiles of material shall be sprayed with water or a",
    "source_id": "chunk_34",
    "tokens": 300,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_34",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-8afd25262c04b87eb2b5c30c2012c22d": {
    "content": "SO, all excavation and earthwork at the cessation of the day's work and when heavy rain is expected.   \n\n(e) Material handling and storage areas shall be levelled and well drained. Stockpiles of material shall be sprayed with water or a dust suppression chemical to minimize dust generation.   \n\n(f) Carry out excavation and earthwork in the dry unless otherwise authorised by the SO. Carry out the formation of cuttings and filling in such a manner that the surfaces have at all times a sufficient minimum cross fall and, where practicable, a sufficient longitudinal gradient to enable them to shed water and prevent ponding. Adopt a method of working which exposes the minimum area of bare soil across the Site. Follow up earthwork immediately with either approved temporary protection or the permanent surface protection and drainage work.   \n\n(g) Rapidly disperse water, whether shed on to the excavation and earthwork, or arising from any other source including flowing into the Site from elsewhere. Provide temporary watercourses, ditches, catch pits, drains, pumping or other means of maintaining excavation and earthwork free from water. Approval shall be sought from the Drainage Services Department and the Environmental Protection Department for the discharge of site effluent into permanent drainage system. Ensure temporary and permanent drainage systems are adequately maintained and clear of rubbish and debris.   \n\n(h) Excavations for structures, pits and trenches shall not be carried out on or near slopes unless measures are taken to prevent water collecting in the excavation and running down the slope.   \n\n(i)",
    "source_id": "chunk_35",
    "tokens": 301,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_35",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-65ac3997af8a0115e2b1da585aea55f8": {
    "content": "adequately maintained and clear of rubbish and debris.   \n\n(h) Excavations for structures, pits and trenches shall not be carried out on or near slopes unless measures are taken to prevent water collecting in the excavation and running down the slope.   \n\n(i) Install permanent drainage systems when practicable and proceed upwards from the low point.   \n\nDo not use rock crushing plant on the Site unless specifically permitted to do so under the Contract.\n\nRock crushing plants  3.6  \n\nTopsoil 3.7  \n\nRemove topsoil when required before starting excavation or filling and, unless otherwise specified, deposit on site in temporary heaps for reuse. Ensure the soil is kept free from contamination and undue compaction.  \n\n# EXCAVATION  \n\nGenerally 3.8  \n\n(a) Adequate support shall be used to maintain excavations in a stable condition and to prevent settlement of structures or utilities due to excavation or dewatering. Construction plant or other vehicles shall not be operated or parked adjacent to excavations and earthworks materials or other materials shall not be placed adjacent to excavations unless this has been allowed for in the design of the temporary works for the support of the excavation.  \n\n(b) Keep excavation free of water in accordance with Clause 3.5.  \n\n(c) Neatly trim the face of excavation.   \n\n(d) Carry out excavation to the lines, levels, dimensions and slopes specified.   \n\n(e) Carefully level the bottom of excavation and step or bench horizontally as specified.",
    "source_id": "chunk_36",
    "tokens": 296,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_36",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-ab1ef9d1392799cab1395f5b20126e29": {
    "content": "Neatly trim the face of excavation.   \n\n(d) Carry out excavation to the lines, levels, dimensions and slopes specified.   \n\n(e) Carefully level the bottom of excavation and step or bench horizontally as specified. Remove any pockets of soft material or loose rock in the bottoms of pits and trenches and fill the resulting cavities and any large fissures with Grade 10 or higher grade concrete. Do not trim the side faces of excavations for at least $24\\mathrm{{hr}}$ after placing any blinding concrete required by the Contract.   \n\n( Backfil in accordance with the GS and at no extra cost “over-excavated\" areas where the Contractor's proposed method of excavation, if approved, involves excavation in excess of that specified in certain areas.   \n\n(g) Maintain excavated surfaces to be used for construction traffic at a level of $300~\\mathrm{mm}$ minimum above formation level unless in rock. Make good any damage to the surface arising from such use with material having the same characteristics as the material which has been damaged.   \n\n(h) Ensure that no construction traffic uses an area once trimming to final formation level has commenced, with the exception of plant necessary for such trimming, and ensure that no damage is caused to the surface by this plant.   \n\n(i) Make good, at no extra cost, surfaces which, after excavation, have deteriorated to a condition that makes compaction of backflling impracticable, either by carrying out additional excavation and filling in accordance with this GS or, by",
    "source_id": "chunk_37",
    "tokens": 307,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_37",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-853a8dda731da7046eefbfee16c90c6b": {
    "content": "(i) Make good, at no extra cost, surfaces which, after excavation, have deteriorated to a condition that makes compaction of backflling impracticable, either by carrying out additional excavation and filling in accordance with this GS or, by waiting until the condition of the exposed material is, in the opinion of the SO, fit to receive the approved backfill.   \n\nG Excavate in such a manner that suitable material is kept separate and store in temporary spoil heaps to the satisfaction of the SO, where required for use in the Works without contamination by unsuitable material or deterioration. Where, in the opinion of the SO, suitable material has become contaminated by unsuitable material or has deteriorated, this material shall be removed from the Site and replaced with suitable imported material at the Contractor's expense.   \n\n(k) Take necessary precautions to prevent damage to existing drains and services encountered inand around the excavation.Should any damage occur, notify the SO and the relevant authorities concerned immediately and make good at no extra cost. Temporarily divert ditches, land drains or other waterways encountered in the excavation and subsequently reinstate at the Contractor's expense.   \n\n(1) Take necessry precautions to prevent damage to tops of piles during excavation.   \n\n(m) Bottoms of excavation shall be approved before any new work is laid. Inform the SO when excavation is ready for inspection. Do not trim and blind the bottom of excavation without approval.",
    "source_id": "chunk_38",
    "tokens": 284,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_38",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-45411b43d6dbd1bdac6a193509e10287": {
    "content": "Do not trim and blind the bottom of excavation without approval.  \n\nNotify the SO of the location and nature of any buried obstruction encountered during excavation. Take up disused drains encountered in the excavation and clear away. Remove any contaminated earth. Disinfect as necessary and seal off ends with concrete. Break up and remove disused manholes and backfill where required with approved material properly compacted.  \n\nBreak out and remove old walls, foundations, piles and other underground structures encountered in the excavation and backfill where required with approved material in accordance with the GS.  \n\n# Removal of excavated material  3.10  \n\nRemove unsuitable material from the Site. Do not remove suitable material from the Site without the permission of the SO, unless surplus to requirements of the Contract. Unsuitable material and surplus materials shall become the property of the Contractor unless otherwise provided for in the Contract. Inform the SO of the proposed dumping areas and take responsibility for making arrangements for disposal of these materials. Notwithstanding the foregoing the SO retains the right to direct the manner in which dumping is to be carried out.  \n\n# Tolerance for excavation  3.11  \n\nExcavation shall be within the tolerances stated in Table 3.2 of the specified design profile.  \n\nTABLE3.2 Tolerances for excavation final surfaces   \n\nIn case of cut slopes, the tolerance shall not exceed $75\\mathrm{mm}$ measured",
    "source_id": "chunk_39",
    "tokens": 283,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_39",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-34929ee12d407c6039669ee3b845052c": {
    "content": "TABLE3.2 Tolerances for excavation final surfaces   \n\nIn case of cut slopes, the tolerance shall not exceed $75\\mathrm{mm}$ measured at right angles to the batter.  \n\nSurfaces of cutting 3.12  \n\nRemove from the side of rock cuttings any inferior stone or soft material intervening between layers of compact rock, or rock which, in the opinion of the SO, will not withstand the weather satisfactorily after exposure. Remove from sides of cuttings rock fragments which move when prized with a crow-bar. The depth from the face of cuttings to which material is to be removed will be determined by the SO. Build up the resulting space to the required profile with Grade 10 or higher grade concrete or masonry in cement mortar to the required profile using rock similar to the adjoining natural rock as instructed by the SO.  \n\nFoundation pits and 3.13 trenches  \n\nDo not excavate trenches and pits wider than is necessary for the construction of the foundation or execution of other works specified therein.  \n\nDo not open any greater length of trench at any one time than that has been approved. Remove all surplus spoil as soon as possible after excavation. Keep stacked spoil for filling tidy and free from contamination at all times.  \n\nNullahs 3.14  \n\nStack excavated materials away from nullahs, stream courses and covered culverts at a point convenient for direct loading on to transport in such a manner as",
    "source_id": "chunk_40",
    "tokens": 287,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_40",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-31e51de407cef5ea05023ca9e91ea127": {
    "content": "stacked spoil for filling tidy and free from contamination at all times.  \n\nNullahs 3.14  \n\nStack excavated materials away from nullahs, stream courses and covered culverts at a point convenient for direct loading on to transport in such a manner as to cause the minimum nuisance to the public.  \n\nBlasting 3.15  \n\nDo not use explosives except when specifically permitted by the Contract, or with prior approval of the SO.  \n\nBlasting operations, including the supply, transport and storage of explosives, on site manufacture of explosives, and the use of explosives including preparing, placing and firing a charge, handle misfires, and destroying or disposing surplus/unused explosives, as well as related preventive, protective, monitoring and contingency measures, shall be in accordance with conditions and restrictions imposed by the Commissioner of Mines. The Contractor shall make all arrangements with and obtain all licences and permits from the Commissioner of Mines in connection with blasting operations.  \n\nGive the SO a minimum of 24 hours’ notice of a proposal to use blasting and give any details he may request concerning the charges, their positions, methods of monitoring the effects of blasting and protective measures. The SO may regulate, restrict or prohibit blasting if, in his opinion, it is necessary to do so for the safety of persons or property, to limit noise or to safeguard the Works. The approval of the SO shall be obtained for each location, or series of locations, where the Contractor wishes to use more than 10",
    "source_id": "chunk_41",
    "tokens": 297,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_41",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-cbe0a403d7ce19e01589a7510ec31d91": {
    "content": "it is necessary to do so for the safety of persons or property, to limit noise or to safeguard the Works. The approval of the SO shall be obtained for each location, or series of locations, where the Contractor wishes to use more than $10\\mathrm{kg}$ of explosive in one blast.  \n\nCarry out pre-splitting trials well in advance of excavation to the final face where explosives shall be used to form a cut rock face required as part of the permanent works. Submit to the SO the following information before commencing the presplitting trials:  \n\n(a) Proposed blast-hole depth, diameter, spacing and orientation.   \n\n(b) Proposed type of explosive, charge weight and delay for each blast hole.  \n\nAdopt an approved pre-splitting technique for forming the final cut rock face.  \n\nTake responsibility for any delays arising from blasting operations.  \n\n# Surface preparation 3.16 for filling material  \n\nClear all soft spots, loose boulders, grass, top soil, bushes, trees, roots and other vegetation or rubbish in natural ground or surface over which filling is to be placed. Do not place filling material until watercourses have been diverted or under drained. Do not place filling material on sloping ground until benches or trenches as described in Clause 3.17 have been completed.  \n\nFilling  \n\n3.17  \n\n(a)  Unless otherwise specified, filling material shall consist of general filling material obtained from excavation on Site, borrow areas or other approved sources.",
    "source_id": "chunk_42",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_42",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-43554f5b575cdf4b4331a961ec2467a5": {
    "content": "described in Clause 3.17 have been completed.  \n\nFilling  \n\n3.17  \n\n(a)  Unless otherwise specified, filling material shall consist of general filling material obtained from excavation on Site, borrow areas or other approved sources.   \n\n(b) Provide for the SO's approval a method statement showing the sources of fill for each fill area, the construction plant to be used for placing filling material and the method of compaction.   \n\n(c) Commence filing works only when sufficient compaction plant is in operation at the place of deposition to ensure compliance with the requirements of Clause 3.19 or 3.20.   \n\n(d) Filling material shall be deposited in layers of a thickness appropriate to the compaction method to be used. In deposition of filling material, ensure that a good bond is achieved between layers of fill, and unless otherwise directed by the SO, no material shall be placed on previously compacted layers unless the surface has been scarified or otherwise broken up and, if necessary, watered.   \n\n(e) Blind the top surface of recycled rock filing material and rock filling material with fine filling material.   \n\n(f) Cut benches or trenches as shown on the drawings and as directed by the SO where filling shall be formed on sloping ground and provide any necessary under-draining of the affected part of the Site.   \n\n(g) Keep the fill area free of water in accordance with Clause 3.5.   \n\n(h) Obtain approval from the SO before commencing filling and before any fill layer is covered.",
    "source_id": "chunk_43",
    "tokens": 304,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_43",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-f572f42125c5d884c8c3680c2fb9a2e9": {
    "content": "necessary under-draining of the affected part of the Site.   \n\n(g) Keep the fill area free of water in accordance with Clause 3.5.   \n\n(h) Obtain approval from the SO before commencing filling and before any fill layer is covered.   \n\n(i) Do not use “end tipping\"” in filling.   \n\n(i) Leave surfaces with no area that can retain water at the end of each day's work and, if necessary, cut ditches to achieve this.   \n\n(k) Stop work when the state of the weather is such that, in the opinion of the SO, it will adversely affect the placing of compacted fill.   \n\n(1) Adopt  one of the following procedures  when  material  placed  and compacted, or awaiting compaction, reaches a condition which, in the opinion of the SO, does not comply with the GS or has been damaged either by weather or in any other way:   \n\n(i) Remove the material from Site, replacing it with equivalent suitable material.   \n\n(i) Remove the material to stockpile until it is in a suitable condition for reuse.   \n\n(ii) Make good the material by mechanical or chemical means.   \n\n(iv) Cease work on the material until it is in a suitable physical condition for reuse.  \n\nObtain approval from the SO before any of these options are adopted.  \n\nRemove, and adopt option (i) or (i) above for any material not complying with the GS that has been overlaid by more recently",
    "source_id": "chunk_44",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_44",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-2151ea24feedeb02741ffd2c577d4c06": {
    "content": "Obtain approval from the SO before any of these options are adopted.  \n\nRemove, and adopt option (i) or (i) above for any material not complying with the GS that has been overlaid by more recently placed material.  \n\n(m) Make good to the satisfaction of the SO settlement in filling and backfilling and any consequential damage that may occur up to the end of the Maintenance Period.  \n\nTolerance for filling 3.18  \n\nFilling shall be within the tolerances stated in Table 3.3 of the specified design profile.  \n\nTABLE 3.3 Tolerances for filling   \n\nCompaction by performance specification  3.19  \n\n(a) Agree with the SO the thickness of each layer which shall be compatible with the particular filling material and the specific compaction plant to be used. Carry out carefully control tests to determine the optimum placing thickness for the particular filling material and the number of passes to achieve the required density with the specific compaction plant to be provided. No permanent fill shall be placed until such compaction procedure and control tests results have been agreed with the SO. Earth moving plant will not be accepted as compaction equipment under this clause. Spread material in layers of uniform thickness and compact as soon as practicable after deposition.  \n\n(b) Test the material to be compacted in accordance with Clause 3.21 to determine its maximum dry density and moisture content.  \n\n(c) Not used.  \n\n(d) Carry out in-situ field density tests",
    "source_id": "chunk_45",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_45",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-9316c0ce05685108e85308a594655957": {
    "content": "soon as practicable after deposition.  \n\n(b) Test the material to be compacted in accordance with Clause 3.21 to determine its maximum dry density and moisture content.  \n\n(c) Not used.  \n\n(d) Carry out in-situ field density tests to determine the relative compaction in accordance with Clause 3.21 after compaction with the following arrangement:  \n\n(i) Test each layer and obtain approval from the SO prior to placing of the next layer, or   \n\n(i) Subject to the approval from the SO, tests for each layer may be performed after filling material in not more than 2 layers above have been deposited and compacted. If the results of any tests at lower layers do not comply with the specified requirements for relative compaction, the soil layer and all the layers above shall be recompacted and tested with additional tests for relative compaction. The number of additional tests shall refer to Table 3.6. Further deposition of filling shall not be allowed unless all the underlying soil layer(s) have satisfied all the test requirements. No claim in respect of re-compaction and additional tests of the soil layer due to noncompliance of the soil underneath will be entertained.  \n\n(e) The relative compaction (RC) of filling material shall be determined in accordance with the following equation:  \n\n$$\n\n\\mathrm{RC}=\\mathrm{IDD}/\\mathrm{MDD}\\times100\\%\n\n$$  \n\nwhere:   \n\n- IDD is the in-situ dry density determined in accordance with Clause3.21   \n\n-",
    "source_id": "chunk_46",
    "tokens": 310,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_46",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-899bc4660be4babd98a4b01d922465ff": {
    "content": "accordance with the following equation:  \n\n\\mathrm{RC}=\\mathrm{IDD}/\\mathrm{MDD}\\times100\\%\n\nwhere:   \n\n- IDD is the in-situ dry density determined in accordance with Clause3.21   \n\n- MDD is the maximum dry density determined in accordance with Clause3.21  \n\n() Unless otherwise specified filling material shall be compacted to obtain the following relative compaction (RC):  \n\n(i) Fill within the $1.5\\mathrm{m}$ thick top surface zone of the platforms and fill within the $2.5\\mathrm{~m~}$ thick top surface zone of the peripheral slopes measured at right angles to the batter - RC of at least $95\\%$   \n\n(ii) Interior of large fill platforms which do not or will not support structures -RC of at least $90\\%$   \n\n(i) Interior of large fill platforms supporting structures - RC of at least $95\\%$   \n\n(iv) Fill immediately below road formation level - RC of at least $98\\%$ for a depth of $200\\mathrm{mm}$   \n\n(v) Backfill to foundation pits or underneath suspended ground slab - RC of at least $90\\%$ Or as agreed by the SO.  \n\nCompaction by method specification shall only be adopted for rock filling material or general filling material with a large portion of coarse material. Submit to the SO for approval a method statement covering particulars of the filing material, compaction layer thickness, specific compaction plant to be used, compaction procedure and the",
    "source_id": "chunk_47",
    "tokens": 315,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_47",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-cdee8c18e0e6da0fb7aa7780487432c5": {
    "content": "only be adopted for rock filling material or general filling material with a large portion of coarse material. Submit to the SO for approval a method statement covering particulars of the filing material, compaction layer thickness, specific compaction plant to be used, compaction procedure and the site control measures. Allow for control tests on the proposed method statement as required by the SO. Inspect and record compaction procedures and details carried out on site.  \n\nCarry out sieve analysis to determine the particle size distribution for each source of filling material. The number of tests required for each source of material shall be as stated in Table 3.5.  If the results do not comply with the specified requirements, additional samples shall be provided from the same batch and additional tests shall be carried out. The number of additional samples shall be as stated in Table 3.5. If the results of the additional tests do not comply with the specified requirements, the material of the source shall not be allowed for compaction by method specification.  \n\nThe size of samples of filling material other than rock filling material shall be in accordance with Geospec 3. Each sample of rock filling material of Grade size not exceeding 200 shall have a mass of at least $250\\mathrm{kg}$ and each sample of rock filling material of Grade size exceeding 200 shall have a mass of at least $1000~\\mathrm{kg}$  \n\n(a) Compaction of rock filing material",
    "source_id": "chunk_48",
    "tokens": 289,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_48",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-3752e78deb6ffdb343e3b34563b886c9": {
    "content": "of rock filling material of Grade size exceeding 200 shall have a mass of at least $1000~\\mathrm{kg}$  \n\n(a) Compaction of rock filing material  \n\n(i) Spread and level each layer of rock filling material and systematically compact by at least 8 passes of a vibratory roller with a minimum static load per $100\\mathrm{mm}$ width of roller of $2\\mathrm{kN}$ or other equivalent plant approved by the SO. Each layer of rock filling material for compaction shall not exceed $400\\mathrm{mm}$ .The final surface of rock filling material shall be compacted by at least two additional passes of a vibratory roller or by other equivalent plant approved by the SO.   \n\n(i) The surface voids of each layer of rock filling material shall be filled with fragments of rock before the next layer is deposited. The final surface of rock filling material shall also be blinded with fine filling material.  \n\n(b) Compaction of general filing material with a large portion of coarse material  \n\nGeneral filling material with a large portion of coarse material shall consist of material of which less than $90\\%$ passesa $20\\mathrm{mm}\\mathrm{BS}$ test sieve. It shall be compacted to the following requirements:  \n\n(i) Spread and level each layer of general filling material with a thickness not less than 1.5 times of the maximum size of the general filling material and not exceeding the maximum depth of compacted layer in accordance with Table 3.4. If",
    "source_id": "chunk_49",
    "tokens": 308,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_49",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-e989e164bdc75cd9b9db8952a44ef4be": {
    "content": ") Spread and level each layer of general filling material with a thickness not less than 1.5 times of the maximum size of the general filling material and not exceeding the maximum depth of compacted layer in accordance with Table 3.4. If there is a presence of oversized coarse material in the filling material, the over-sized coarse material shall be removed or broken down to sizes acceptable to the SO. Each layer shall be systematically compacted by an approved vibratory roller with the stipulated minimum number of passes corresponding to the minimum static load per $100\\mathrm{mm}$ Width of the roller.  \n\n(ii) The number of passes of the roller shall only be counted when the roller is travelled on the material to be compacted at a speed of not morethan $2\\mathrm{km/hr}$ with full vibration.Plant with addition of external load to increase the static load of the vibratory roller shall be disregarded in counting the number of passes.  \n\nTABLE3.4 Compaction requirement for general filling material with a large portion of coarse material   \n\nTest for determining  3.21   \n\nthe degree of   \n\ncompaction of   \n\ncompacted fill  \n\nArrange for tests specified below to be carried out by the Public Works Laboratories (PWL).  \n\n(a) Compaction tests shall be carried out on Site unless approved otherwise. (b) Determine the maximum dry density and optimum moisture content in accordance with Geospec 3.  \n\nTest each soil type when first used and thereafter at the same time as",
    "source_id": "chunk_50",
    "tokens": 303,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_50",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-68f7390592442a94bfb31c9ceff12aba": {
    "content": ") Compaction tests shall be carried out on Site unless approved otherwise. (b) Determine the maximum dry density and optimum moisture content in accordance with Geospec 3.  \n\nTest each soil type when first used and thereafter at the same time as every set of field density tests is carried out or whenever the SO may direct. Unless otherwise specified, the number of tests required shall be as stated in Table 3.5. Keep the records identifying the soil type and the location within the Works.  \n\nTABLE3.5 Number of samples for testing of optimum moisture content and maximum dry density of filling material and sieve analysis of the same source of filling material   \n\n(C) Determine the in-situ field density and moisture content in accordance with Geospec 3 as directed by the SO to determine the relative compaction achieved.  \n\nUnless otherwise stated in the Contract, the number of tests required shall be as stated in Table 3.6. Keep records identifying the soil type and location in the Works and showing the following information for each series of tests:  \n\n(i) Dry density of soil tested. (i) Moisture content. (i) Relative compaction achieved $(\\%)$  \n\n(d) Determine moisture content in accordance with moisture content tests under Geospec 3 by means of a drying oven.  \n\nTABLE3.6 Number of samples for testing of moisture content and relative compaction   \n\n# Filling of foundation 3.22 pits and trenches  \n\nDeposit and compact suitable filling material to achieve the",
    "source_id": "chunk_51",
    "tokens": 302,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_51",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-79e76b6ecbad53a6515d44e7de693ce1": {
    "content": "TABLE3.6 Number of samples for testing of moisture content and relative compaction   \n\n# Filling of foundation 3.22 pits and trenches  \n\nDeposit and compact suitable filling material to achieve the compaction specified in Clause 3.19 (f) unless otherwise shown on the Drawings or directed by the SO. Carefully remove planking and strutting and other excavation supports as the filling proceeds except where they are specified or required by the SO to be left in position.  \n\n# Embankments 3.23  \n\n(a) Form embankments of special filling material unless otherwise specified.   \n\n(b) Deposit and compact all earthwork material for filling as soon as practicable after excavation. Build up embankments evenly over the full width. Control and direct construction traffic during the construction of embankments uniformly over their full width. Form sloping faces of embankments and other fill areas by 1 m overfilling unless otherwise directed by the SO and cutting back to the desired profile. Make good damage to compacted layers caused by construction traffic.   \n\n(c) Compact embankments in accordance with Clause 3.19 or 3.20.  \n\n(d) Adopt one of the following procedures at no extra cost when material deposited as fill subsequently reaches a condition such that it cannot be compacted in accordance with the GS.  \n\n(i) Make good by removing the material from the embankment to tip or elsewhere until it is in",
    "source_id": "chunk_52",
    "tokens": 290,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_52",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-cc74aa2bf362676603f85d9b2f1649f8": {
    "content": "following procedures at no extra cost when material deposited as fill subsequently reaches a condition such that it cannot be compacted in accordance with the GS.  \n\n(i) Make good by removing the material from the embankment to tip or elsewhere until it is in a suitable physical condition for reuse and replace it with suitable material.   \n\n(i) Make good the material by approved mechanical or chemical means to improve its stability.   \n\n(ii) Cease work on the material until its physical condition is suitable such that it can be compacted in accordance with the GS.  \n\n(e) Rock used in rock fill embankments shall, except for any specified external cover to slopes or near formation level, be of a size such that it can be deposited in horizontal layers each not exceeding $450\\mathrm{mm}$ thickbefore compaction, extending over the full width of the embankment. Spread and level the material by a crawler tractor weighing not less than $15\\mathrm{~t~}$ and compact in accordance with Clause 3.20(a). Each layer shall consist of reasonably graded rock and all surface voids shall be filled with broken fragments before the next layer is placed. Blind the top surface and side slopes of embankments so formed with approved fine filing material to seal the surface. On side slopes and verges, such material may be topsoil as defined in Clause 3.1.",
    "source_id": "chunk_53",
    "tokens": 279,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_53",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-4d1ac8edc636b0d97716b324f7b274c2": {
    "content": "the surface. On side slopes and verges, such material may be topsoil as defined in Clause 3.1.  \n\n(f) Isolated boulders each within the range $0.015~\\mathrm{m}^{3}$ to $0.10~\\mathrm{m}^{3}$ in size may be incorporated in embankments not of rock fill at the discretion of the SO provided that the specified compaction requirements are met. Boulders exceeding $0.015~\\mathrm{m}^{3}$ shall be placed a minimum of $2\\textrm{m}$ below formation level of carriageways or hard-shoulders.  \n\n(g Form embankments equally on both sides of culverts or drain pipes and the like.  \n\n(h) Where surfaces of embankment are required for use by construction traffic, build up and maintain at minimum $300\\mathrm{mm}$ above formation level the area between the extremities of carriageways, including any central reserve and hard shoulders before subsequently trimming to formation level. Make good surface damage at no extra cost. Ensure that no construction traffic uses an area once trimming to final formation level has commenced, with the exception of plant necessary for such trimming and ensure that no damage is caused to the surface by such plant.  \n\nFilling existing 3.24 watercourses  \n\nDivert existing watercourses and channels as required and clear the same of all vegetable growth and soft deposits and carefully fill in with suitable material deposited and compacted as specified.",
    "source_id": "chunk_54",
    "tokens": 305,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_54",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-44dff63a4b7c592559cdf3bd44effa8c": {
    "content": "3.24 watercourses  \n\nDivert existing watercourses and channels as required and clear the same of all vegetable growth and soft deposits and carefully fill in with suitable material deposited and compacted as specified.  \n\nBackfilling behind 3.25 retaining walls  \n\nBackfil behind retaining walls with the graded filter drain specified. The grading of filter material shall be such so as to prevent the filling material from being washed through the filter.  \n\nPlace graded filter with care to avoid contamination and in layers simultaneously with the filling material and compact in the same manner as the filling material.  \n\nPlace general filling material or special filling material as specified on the drawings as backfilling to the sections shown on the drawings and thoroughly compact to achieve RC of at least $90\\%$ unless otherwise stated on the drawings or directed by the SO. Avoid excessive compaction to filling material behind retaining walls.  \n\n# PREPARATION ANDSURFACE TREATMENT OF ROADFORMATION  \n\nGenerally  \n\n3.26  \n\nCarry out preparation and surface treatment of the road formation after completion of any specified subgrade drainage and, unless otherwise agreed by the SO, immediately prior to laying the sub-base or the road-base where no sub-base is required. Follow the following sequence of operations :  \n\n(a) Formations other than rock fill  \n\n(i) Remove all mud and slurry from surfaces below carriageways, laybys, cycle tracks, footpaths and hard-shoulders after general reinstatement of any soft areas.   \n\n(i) Compact surface by",
    "source_id": "chunk_55",
    "tokens": 300,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_55",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-6d842b2b4b4866013b779c8cf67d1e37": {
    "content": "(a) Formations other than rock fill  \n\n(i) Remove all mud and slurry from surfaces below carriageways, laybys, cycle tracks, footpaths and hard-shoulders after general reinstatement of any soft areas.   \n\n(i) Compact surface by 4 passes of a smooth-wheeled roller having a load per $100\\mathrm{mm}$ width of roller of $4.35\\mathrm{kN}-6.10\\mathrm{kN}$   \n\n(ii) Trim the formation.   \n\n(iv) Roll the trimmed formation by 1 pass of a smooth-wheeled roller having a minimum load per $100\\mathrm{mm}$ width of roller of $2.1\\mathrm{kN}$ , or a vibratory roller having a minimum static load per $100\\mathrm{mm}$ width of vibratory roller of $0.7\\mathrm{kN}$ or a vibratory plate compactor having a minimum static pressure under the base plate of $13.8\\mathrm{kPa}$ .Where the completed formation is not immediately covered with sub-base material, protect it with a membrane of 65 to $80~\\upmu\\mathrm{m}$ impermeable plastic sheeting with $300\\mathrm{mm}$ laps or other approved means to prevent ingress of moisture.  If the moisture content of the accepted compacted material is allowed to reach a value above the maximum permitted for the material, allow the material to revert to an acceptable moisture content and, if directed by the SO, make good the surface at no extra cost by recompaction",
    "source_id": "chunk_56",
    "tokens": 314,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_56",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-533337b4642ab260f9d413051f8ec1db": {
    "content": "of the accepted compacted material is allowed to reach a value above the maximum permitted for the material, allow the material to revert to an acceptable moisture content and, if directed by the SO, make good the surface at no extra cost by recompaction before laying the subbase or road-base.  \n\n(b) Formations of rock fill:  \n\n(i) Trim and blind the formation in accordance with the requirements of Clause 3.23. (i) Roll the trimmed formation as specified in Clause 3.26 (a) (iv) above.  \n\n(c) Formations of rock cuttings : Make good with lean concrete any surface irregularities under the formation which remain after trimming of rock excavation.  \n\n# SOIL-CEMENT FILL  \n\nSoil-cement 3.27  \n\n(a) Soil-cement shall consist of Portland Cement (PC), sand and inorganic soil in the proportions 1:3 :12 by mass.   \n\n(b) PC shall comply with Clause 6.27.   \n\n(c) Sand shall be natural sand or crushed natural stone complying with BS1200:2019.   \n\n(d) Inorganic soil shall be free from organic matter and shall contain no more than $30\\%$ of soil particles passing a $63~{\\upmu\\mathrm{m}}$ BS test sieve.  \n\n# SECTION 4  \n\n# STEEL SHEET PILING WORK  \n\n# MATERIALS  \n\n# Steel sheet pile sections  4.1  \n\nSteel sheet piles shall be weldable structural steel to BS EN",
    "source_id": "chunk_57",
    "tokens": 307,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_57",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-0519794d9394c296dd3047b1ce87a9d4": {
    "content": "upmu\\mathrm{m}}$ BS test sieve.  \n\n# SECTION 4  \n\n# STEEL SHEET PILING WORK  \n\n# MATERIALS  \n\n# Steel sheet pile sections  \n\n4.1  \n\nSteel sheet piles shall be weldable structural steel to BS EN 10248-1 GradeS270GP.  \n\nSteelwork and accessories for use in the system of lateral support shall be as Section 15 -Structural SteelWork.  \n\nTesting of steel sections and accessories shall be as Section 15 - Structural Steel Work.  \n\nFabricate special and non-standard sheet piles including corner piles and junction piles from sheet pile sections approved for use in the Works.  \n\nProvide sheet piles in single continuous lengths unless otherwise specified.  \n\n# INFORMATIONTOBEPROVIDED  \n\n# Tender submission 4.2  \n\nSubmit the following information when specified in the tender documents:  \n\n(a) Type of sheet pile proposed including proprietary name, grade of steel, sectional modulus and qualities.   \n\n(b) Proposed sequence for installation of sheet piles.   \n\n(c) Details of special or non-standard piles.   \n\n(d) Details of initial trenching and guide frames.   \n\n(e) Details of pile driving equipment selected including proprietary names.   \n\n(f) Proposed method of pitching and driving piles to the tolerances given in Clause 4.10.   \n\n(g) Contingency proposals for the remedy of piles installed outside the tolerances.   \n\n(h) Detailed calculations of the proposed sheet piles and the system of lateral support of sheet piles prepared",
    "source_id": "chunk_58",
    "tokens": 300,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_58",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-07f48f373559ada46d528942f754f91f": {
    "content": "to the tolerances given in Clause 4.10.   \n\n(g) Contingency proposals for the remedy of piles installed outside the tolerances.   \n\n(h) Detailed calculations of the proposed sheet piles and the system of lateral support of sheet piles prepared by a Registered Structural Engineer when specified.   \n\n(i) Proposed sequence of excavation and installation of system of lateral support if applicable.   \n\n(i) Proposed system to monitor the effect of excavation and dewatering on adjacent buildings, pavements, public or private services and any other structures or permanent features as Clause 4.6.   \n\n(k) Undertaking that the noise caused by the sheet piling works shall satisfy the legislation currently in force.   \n\nProvision of details 4.3   \n\nbefore   \n\ncommencement of   \n\nworks  \n\nWhen specified, submit detailed drawings with the method statements showing:  \n\n(a) The setting out arrangement for construction of the pile wall in relation to the Site and to adjoining structures. Each pile shall be annotated with a reference number and length.   \n\n(b) The sub-division of the pile wall into panels for the purposes of driving.   \n\n(c) The location of corner and closure piles.   \n\n(d) Proposed work on standard piles, e.g. holes for lifting.   \n\n(e) Design for the fabrication of corner, closure, taper and other non-standard piles.   \n\n(f) The proposed sequence of driving by panel and by individual pile.   \n\n(g) Design of the guide frames required at all locations in the Works to",
    "source_id": "chunk_59",
    "tokens": 296,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_59",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-0460ce597336a426487f5b621a9653a2": {
    "content": "(e) Design for the fabrication of corner, closure, taper and other non-standard piles.   \n\n(f) The proposed sequence of driving by panel and by individual pile.   \n\n(g) Design of the guide frames required at all locations in the Works to support piles for pitching and driving within required tolerances.   \n\n(h) Design of lateral support if applicable, including details of connections of walings, strutting, bracing, posts and splicing of members and sequence of construction and sequence of subsequent removal if applicable.  \n\nDo not change the method of installing sheet piles without approval.  \n\n# WORKMANSHIP  \n\nPreliminary ground 4.4 investigation  \n\nThe Contractor shall carry out any additional preliminary ground investigation he deems necessary to ascertain the nature of the ground and sub-soil, including the oversite water table level and the nature of the materials, (whether naturally occurring or otherwise), into which the sheet piles shall be installed. Allow for liaising with the SO regarding access to the Site and the execution of ground investigation works. Keep all nuisance to a minimum and make good drill holes, trial pits etc., after completion in accordance with the SO's requirements.  \n\nExisting services 4.5  \n\nComply with the following when it is necessary to carry out any work in the vicinity of utility services:  \n\n(a) Advise the relevant utility undertaking at least 7 days before commencement of theWorks.   \n\n(b) Excavate by hand to a depth sufficient to ascertain the position of",
    "source_id": "chunk_60",
    "tokens": 297,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_60",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-2be1dde0311a2de65e9cd6a5c9be70f4": {
    "content": "necessary to carry out any work in the vicinity of utility services:  \n\n(a) Advise the relevant utility undertaking at least 7 days before commencement of theWorks.   \n\n(b) Excavate by hand to a depth sufficient to ascertain the position of service pipes etc. to ensure that these services are not damaged.   \n\nMonitoring system   \n\nand ground   \n\nsettlement  \n\nProvide a system to monitor the effects of sheet piling work, subsequent excavation and dewatering on adjacent buildings, pavements, public or private services and any other structures or permanent features. The monitoring system must be adequate to effectively monitor ground movement.  \n\nDo not lower the ground water table level beyond the boundary of the Site unless otherwise specified, and adopt the approved measures to control and monitor ground water table levels.  \n\nPre-load struts or braces and carry out grout injection if required by the Site conditions to minimise ground settlement.  \n\nLateral support 4.7  \n\nDesign by a Registered Structural Engineer when specified, the system of lateral support to the sheet piles to resist horizontal soil and water pressure arising from sub-soil conditions.  \n\nConstruct the system of lateral support as Section 15 - Structural Steel Work when detailed design is provided.  \n\nInstall members of the system of lateral support as excavation proceeds in stages in accordance with the approved construction sequence in the method statement as Clause 4.3 (h) or the designed sequence provided, whichever is applicable.  \n\n# Marking  \n\n4.8  \n\nIdentify sheet piles on the Site",
    "source_id": "chunk_61",
    "tokens": 297,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_61",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-192b9ea9aaa0688d3c7c030ee910402b": {
    "content": "as excavation proceeds in stages in accordance with the approved construction sequence in the method statement as Clause 4.3 (h) or the designed sequence provided, whichever is applicable.  \n\n# Marking  \n\n4.8  \n\nIdentify sheet piles on the Site by marking with the relevant number in accordance with the approved drawings of the sheet pile arrangement.  \n\nMark the length on each pile and calibrate the pile at $1\\textrm{m}$ intervals along the length to permit checking by the SO.  \n\nWelding and splicing  4.9  \n\nWelding shall be in accordance with Section 15 - Structural Steel Work.  \n\nSheet piles not exceeding $12\\textrm{m}$ long shall be in single lengths. Piles in excess of $12\\textrm{m}$ may be spliced with approval. Splice sheet piles by full strength butt welding and maintain the true vertical alignment.  \n\nForm special and non-standard sheet piles by full strength butt welding.  \n\n# Tolerance  \n\n4.10  \n\nInstall sheet piles within the following tolerances:  \n\n(a) Deviation from the correct line at ground level: Not exceeding $15\\mathrm{mm}$   \n\n(b)  Deviation from verticality of individual piles in any direction: (i) Generally: Less than $1:400$ (i) For end piles in panels and for guide piles: Less than $1:500$  \n\nNotwithstanding these specified tolerances, piles shall always be driven to ensure that the stated dimensions of any permanent structural elements are not reduced",
    "source_id": "chunk_62",
    "tokens": 315,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_62",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-280acf57ad9dd8c801c63f3ab0b33770": {
    "content": ":400$ (i) For end piles in panels and for guide piles: Less than $1:500$  \n\nNotwithstanding these specified tolerances, piles shall always be driven to ensure that the stated dimensions of any permanent structural elements are not reduced.  \n\nPitching 4.11  \n\nProvide rigid guide frames at upper and lower levels on both sides of the sheet piles. Accurately set out and interlock piles within the guide frames. Guide frames shall be designed to maintain piles in their true positions within tolerance during driving.  \n\nDriving 4.12  \n\nKeep noise and vibration to a minimum when driving sheet piles. Comply with the legislation currently in force in connection with noise control. Drive piles to the specified penetration with high frequency vibration pile drivers. For hard driving only, other methods could be adopted if approved.  \n\nExtract and re-drive sheet piles installed outside tolerance. Replace any extracted piles that the SO considers as unfit for re-driving. Alternatively, the SO may approve the insertion of taper or other non-standard piles or other methods of correcting the plumb of piles.  \n\nDrive sheet piles in any length or panel progressively, with the top of no individual pileexceeding $600\\mathrm{mm}$ below the top of the adjacent piles.  \n\nObstructions  \n\n4.13  \n\nAdvise the SO immediately when obstructions are encountered that prevent the installation of any sheet piles to the specified penetration.  \n\nAdopt an approved method for overcoming the obstruction which, depending on",
    "source_id": "chunk_63",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_63",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-281e63ef5ea44e3c17d3722dc8f8b69d": {
    "content": "the adjacent piles.  \n\nObstructions  \n\n4.13  \n\nAdvise the SO immediately when obstructions are encountered that prevent the installation of any sheet piles to the specified penetration.  \n\nAdopt an approved method for overcoming the obstruction which, depending on actual circumstances, may include:  \n\n(a) Withdrawing the sheet piles, excavating for and removing the obstruction, backfilling and subsequently re-driving the sheet piles.  \n\n(b) Leaving the sheet piles at the depth of penetration achieved, excavating for and removing the obstruction, backfilling and subsequently completing the installation of the sheet piles.   \n\n(c) Driving the sheet piles on either side of the piles obstructed to the full penetration specified, removing the obstruction during general excavation work and subsequently completing the driving of the piles obstructed. This method of removing obstructions may only be adopted with the express permission of the SO.   \n\n(d) Driving through the obstruction under controlled conditions. Replace any sheet piles damaged through the adoption of this method.   \n\n(e) Withdrawing and temporarily removing sheet piles, boring through the obstruction from ground level with approved drilling equipment and subsequently replacing and re-driving the piles.  \n\nProvide temporary propping / bracing to obstructed sheet piles when a significant length of pile remains above the general top level of adjacent piles.  \n\n# Extraction  \n\nDo not extract sheet piles unless otherwise specified.  \n\nBurning off 4.15  \n\nBurn off the tops of sheet piles driven to full penetration to the level required when specified",
    "source_id": "chunk_64",
    "tokens": 297,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_64",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-236b29a29d6f0ea26b97723b61edb69a": {
    "content": "pile remains above the general top level of adjacent piles.  \n\n# Extraction  \n\nDo not extract sheet piles unless otherwise specified.  \n\nBurning off 4.15  \n\nBurn off the tops of sheet piles driven to full penetration to the level required when specified.  \n\nBurn off the tops of sheet piles damaged by hard driving when so directed.  \n\nSheet pile record 4.16  \n\nProvide the SO with a record, in duplicate, for sheet piles driven the previous day giving for each pile its identity number and the reference of the rig used. The following data shall also be included:  \n\n(a) Date sheet pile pitched.   \n\n(b) Length of completed sheet pile and whether spliced.   \n\n(c) Type of pile drivers used at all stages to achieve specified penetration.   \n\n(d) Depth of penetration below an agreed datum level.   \n\n(e) Details of any driving damage.   \n\n(f) Alignment of completed sheet pile.   \n\n(g) Details of any obstructions encountered and  measures adopted overcoming the same if applicable.  \n\nRe-use steel sheet 4.17 pile from other site  \n\nRe-use of steel sheet piles from other site is permissible if they are used as temporary works and their physical conditions are considered satisfactory by the SO.  \n\nFor steel sheet piles re-used as temporary works with design prepared by the Contractor that require checking and certification by independent checking engineer or structural design checker, mill certificate and testing requirements of steel sheet piles may be exempted by the independent checking engineer or structural design checker who shall provide",
    "source_id": "chunk_65",
    "tokens": 300,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_65",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-88db48c0b64610e21ec53e6b5b99530e": {
    "content": "# SECTION 10  \n\n# MASONRY  \n\n# GENERAL  \n\n# Stone  \n\n10.1  \n\nStone, generally, shall be granite of consistent colour, free from defects and ferrous materials that will adversely affect strength or appearance, to BS EN 771-6 and shall comply with BS EN 1996-1-1, NA to BS EN 1996-1-1, BS EN 1996-1-2, NA to BS EN 1996-1-2, BS EN 1996-2, NA to BS EN 199",
    "source_id": "chunk_259",
    "tokens": 115,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_259",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-ab1639258904b34365832302b3121135": {
    "content": "1, NA to BS EN 1996-1-1, BS EN 1996-1-2, NA to BS EN 1996-1-2, BS EN 1996-2, NA to BS EN 1996-2,BS EN 996-3, NA+A1 to BS EN 1996-3 and PD 6697 when applied to masonry structures. Test methods according to clause 2 of BS EN 771-6.  \n\n# Micro conditions of 10.2 exposure  \n\nMicro conditions of exposure of completed masonry, as in Clause 2.1.2.1 and Annex A of BS EN 1996-2 shall be categorized into classes, as follows:  \n\nMX1 - In a dry environment;   \n\nMX2 - Exposed to moisture or wetting;   \n\nMX3 - Exposed to moisture or wetting plus freeze/thaw cycling;   \n\nMX4 - Exposed to saturated salt air or seawater;   \n\nMX5 - In an aggressive chemical environment.  \n\nMasonry units, mortar, concrete infill, ancillary components and reinforcement shall be selected according to Annex B and C of BS EN 1996-2 based on the appropriate class of micro conditions of exposure of completed masonry.  \n\n# MATERIALS  \n\nSubmit samples of stone for the SO's approval before ordering.  \n\nApproval of stone 10.3   \n\nMortar 10.4   \n\nDamp proof course 10.5   \n\nWall",
    "source_id": "chunk_260",
    "tokens": 299,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_260",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-e27c933e2cf656198397ab504be29500": {
    "content": "of exposure of completed masonry.  \n\n# MATERIALS  \n\nSubmit samples of stone for the SO's approval before ordering.  \n\nApproval of stone 10.3   \n\nMortar 10.4   \n\nDamp proof course 10.5   \n\nWall ties 10.6  \n\nMortar shall be as Clauses 9.12 to 9.17 and 9.21 to 9.25.  \n\nDamp proof course shall be as Clause 9.10.  \n\nTies between walls and concrete shall be $20\\mathrm{x}3~\\mathrm{mm}$ stainless steel 316 flats $350\\mathrm{mm}$ long, fanged at both ends and shall be to BS EN $\\mathbf{845{-1+}A1}$  \n\n\"Ties for walls built against face of concrete to be formed from $20\\mathrm{~x~}3\\mathrm{~mm}$ stainless steel 316 flats $150\\mathrm{mm}$ long, fanged at both ends and shall be to BS EN $\\mathbf{845{-1+}A1}$  \n\n# WORKMANSHIP  \n\nTolerances  \n\n10.7  \n\nBuild masonry to the tolerances as follows:  \n\nTABLE 10.1 Tolerance (+ or - mm)   \n\nMock up sample 10.8  \n\nProvide stone works “mock up” samples, approximately $1~\\mathrm m^{2}$ ofstoneworks, including pointing on Site for the SO's approval if the stonework is extensive and/or as directed",
    "source_id": "chunk_261",
    "tokens": 307,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_261",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-7cda1485fa65d47ca3d05df7627a2694": {
    "content": "Mock up sample 10.8  \n\nProvide stone works “mock up” samples, approximately $1~\\mathrm m^{2}$ ofstoneworks, including pointing on Site for the SO's approval if the stonework is extensive and/or as directed by the SO. All details including colour, finish, mortar type, pointing, wall ties, damp proof course and like matters for the source and type of each material shall be agreed before work commences.  \n\nSample panels shall be used as means of comparison against which the SO shall determine the compliance or otherwise of the masonry in the permanent work. The sample panels shall be protected from damage and shall be left in a position until the SO instructs their removal.  \n\nIf in the opinion of the SO the stone work in the sample panel does not comply with the specified requirements for the masonry, the proposed changes to materials and methods of construction shall be submitted to the SO; further sample panels shall be constructed until the sample panel complies with the specified requirements.  \n\nTypes of walling 10.9  \n\nTypes of rubble and ashlar walling should be in strict accordance with the Manufacturer’s instructions and standards, unless otherwise approved or instructed by theSO.  \n\n# Preparation of stone 10.10 for rubble stone walling  \n\nPrepare stones to the following sizes, unless otherwise specified in the Drawings:  \n\n(a) Random rubble - Stones shall be irregularly shaped roughly cut $75\\mathrm{mm}$ to $300\\mathrm{mm}$ high",
    "source_id": "chunk_262",
    "tokens": 300,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_262",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-0a1c9f897e114381a85bc0199f955947": {
    "content": "10 for rubble stone walling  \n\nPrepare stones to the following sizes, unless otherwise specified in the Drawings:  \n\n(a) Random rubble - Stones shall be irregularly shaped roughly cut $75\\mathrm{mm}$ to $300\\mathrm{mm}$ high, and $75\\mathrm{mm}$ (minimum) deep and $75\\mathrm{mm}$ to $600\\mathrm{mm}$ long on bed. The length or depth on bed of each stone shall be greater than the height.   \n\n(b) Squared uncoursed rubble - Trim stones roughly square $75\\mathrm{mm}$ to $300\\mathrm{mm}$ high, varying in $75\\mathrm{mm}$ stages. Each stone shall be $100\\mathrm{mm}$ to $150\\mathrm{mm}$ deep and $100\\mathrm{mm}$ to $600\\mathrm{mm}$ long on bed. Length or depth on bed of each stone shall be greater than the height.   \n\n(c) Squared coursed rubble - Trim stones roughly square as (b), but to suit courses of regular height varying from $150\\mathrm{mm}$ to $250~\\mathrm{mm}$  \n\nLaying and 10.11 jointing  \n\nRubble shall be laid dry on a full even bed of cement mortar. All joints shall be filled and shall be between $5\\mathrm{mm}$ and $15\\mathrm{mm}$ wide.  \n\nRandom rubble 10.12  \n\nRubble of random shapes and sizes in random rubble walling shall be bonded together",
    "source_id": "chunk_263",
    "tokens": 316,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_263",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-f982e613ed3656c46e7cb98a71d32c25": {
    "content": "mortar. All joints shall be filled and shall be between $5\\mathrm{mm}$ and $15\\mathrm{mm}$ wide.  \n\nRandom rubble 10.12  \n\nRubble of random shapes and sizes in random rubble walling shall be bonded together over each face of the wall. Rubble shall be selected and rough dressed to keep joint widths to a minimum. At least one bonding rubble of minimum size $450\\mathrm{mm}\\times150\\mathrm{mm}$ (minimum) shall be provided and carried through the full thickness of the wall per square meter (see Diagram A). No more than 3 nos. rubble shall be adjacent to a vertical joint.  \n\n# Squared uncoursed 10.13 rubble  \n\nRoughly squared rubble of random sizes in square rubble walling shall be bonded together with continuous straight horizontal joints. The numbers of vertical joints shall be kept to a minimum (see Diagram B).  \n\nBeds and joints to be rough punched so as to produce a joint not less than $10\\mathrm{mm}$ and greater than $20\\mathrm{mm}$ in thickness.  \n\n10.14  \n\n# Squared rubble brought up to courses  \n\nRoughly squared rubble in square coursed walling shall be laid as stated in Clause 10.12 but brought up to courses at centers not exceeding $750\\mathrm{mm}$ to lineup with quoin and jamb stones (see Diagram C).  \n\nSquared coursed rubble  \n\nRoughly squared rubble of random size",
    "source_id": "chunk_264",
    "tokens": 305,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_264",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-b752e40ea170ec169cb59ae5153151b9": {
    "content": "in Clause 10.12 but brought up to courses at centers not exceeding $750\\mathrm{mm}$ to lineup with quoin and jamb stones (see Diagram C).  \n\nSquared coursed rubble  \n\nRoughly squared rubble of random size in squared rubble walling shall be bonded together in regular courses with continuous straight horizontal joints (see Diagram D).  \n\n10.16  \n\nSquared rubble walling exceeding $300~\\mathrm{mm}$ thick  \n\n(a) Squared rubble walling exceeding $300\\mathrm{mm}$ thick and faced one side shall be constructed (see Diagram E) in accordance with the following requirements: (i Roughly squared rubble at least $300\\mathrm{mm}$ thick shall be provided with a backing of random rubble.  \n\n(ii) At least 2 bonding rubble per square meter shall be regularly spaced and carried through the full thickness of the wall or at least $450\\mathrm{mm}$ into the backing, whichever is less.  \n\n(b) Squared rubble walling exceeding $300\\mathrm{mm}$ thick and faced both sides shall be constructed in accordance with the following requirements:  \n\n(i Roughly squared rubble at least $150\\mathrm{mm}$ thick shall be provided with a core of random rubble.   \n\n(i) Bonding stones shall be provided as stated in Clause 10.16 (a) but shall be carried through the full thickness of the wall or at least $450\\mathrm{mm}$ into the core.  \n\nPointing rubble 10.17",
    "source_id": "chunk_265",
    "tokens": 305,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_265",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-47ffc0c9902f19d00f808a9cb5c3549d": {
    "content": ") Bonding stones shall be provided as stated in Clause 10.16 (a) but shall be carried through the full thickness of the wall or at least $450\\mathrm{mm}$ into the core.  \n\nPointing rubble 10.17 walling  \n\nJoints in rubble walling shall be raked out to a depth of $15\\mathrm{mm}$ astheworks proceeds. The joints shall be pointed in cement mortar on completion with a flush, weathered or recessed joint as specified.  \n\nPreparation of stone 10. for ashlar walling  \n\nThe exposed faces and joint faces of each stone for ashlar stone walling shall be dressed squared and true free from hollows or rough areas. Finish exposed faces to a finely squared dressed surface. Stones shall be not less than $300\\mathrm{mm}$ high.Each stone shall be clearly marked to indicate its position in finished work.  \n\nLaying and jointing 10.19 ashlar walling  \n\nStones in ashlar walling shall be laid on a full, even bed of mortar consisting of cement and fine crushed stone in proportions 1:3 by volume. All joints shall be filled and shall be $5\\mathrm{mm}$ wide. Stones shall be laid to bond together throughout the wall, and to the backing, using projection bonding stones.  \n\nPointing ashlar walling  \n\n10.20  \n\nJoints in ashlar walling shall be raked to a depth of",
    "source_id": "chunk_266",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_266",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-b2b4b48291d19a39df426619c7dd8cf9": {
    "content": "Stones shall be laid to bond together throughout the wall, and to the backing, using projection bonding stones.  \n\nPointing ashlar walling  \n\n10.20  \n\nJoints in ashlar walling shall be raked to a depth of $15\\mathrm{mm}$ astheworksproceeds and shall be finished with a weathered or recessed joint as specified on completion using bedding mortar.  \n\nTransportation, storage and handling  \n\n# 10.21  \n\nThe transport of stone to the site should be so arranged with the minimized amount of handling. Precautions should be taken, by careful stacking and by packing in clean wheat straw or other suitable material, to guard against accidental damage to the stones. Particular care is needed in the transport of stone by sea, to ensure that it remains uncontaminated by salts throughout the journey. Store stone in stacks on battens, and protect from rain.  \n\nIt should be stored clear of the ground to prevent the leaching of soil salt into it, or staining from moisture.  \n\nProvide adequate lifting plant to unload and handle stones into position.  \n\nProtection of newly 10.2 erected stone work  \n\nNewly erected stone works shall be well protected from exposure to conditions which may adversely affect the masonry.  \n\nAll stone arrises and projecting members should be protected immediately after fixing by wooden slats, strips or shields firmly fixed. Stone liable to stain should be coated over the whole face with a slurry of lime putty, plaster and stone dust",
    "source_id": "chunk_267",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_267",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-5588877d974ce314921aa5fe10b0534c": {
    "content": ".  \n\nAll stone arrises and projecting members should be protected immediately after fixing by wooden slats, strips or shields firmly fixed. Stone liable to stain should be coated over the whole face with a slurry of lime putty, plaster and stone dust as soon as possible after fixing.  \n\nWhen the scaffold is dropped, at the completion of the work, the coating and all mortar splashes should be removed; the face should be well scrubbed, and washed down with clean water.  \n\nClean off, rub down and leave stonework perfect immediately before handover.  \n\nWalling built against 10.23 concrete, etc.  \n\nWall ties in masonry which is to face an existing or newly constructed wall shall befixed at arate of $\\dot{5}\\mathrm{m}^{2}$ .Ties shall be fixed $100\\mathrm{mm}$ intothewall and $75\\mathrm{mm}$ into masonry.  \n\nWall ties shall be fixed between the ends of walls and concrete to brickwork at centresof at least $450\\mathrm{mm}$ vertically and shall project $250\\mathrm{mm}$ into the masonry.  \n\nUpon the SO's instruction, the performance requirement testing on structural fixings in concrete and masonry should be to BS 5080-1 and BS 5080-2.  \n\n# Maintenance repair 10.24 and cleaning  \n\nTwo copies of the “Methods of Repair and Cleaning Instruction/Guideline” shall be submitted to the SO, within 3 months after completion of",
    "source_id": "chunk_268",
    "tokens": 304,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_268",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-23af10dcefa621862cc54499c10b0354": {
    "content": "-1 and BS 5080-2.  \n\n# Maintenance repair 10.24 and cleaning  \n\nTwo copies of the “Methods of Repair and Cleaning Instruction/Guideline” shall be submitted to the SO, within 3 months after completion of the masonry works, for comment and approval.  \n\nMaintenance cleaning of stones shall be done by means of:  \n\n(a) Washing; (b) Abrasive blasting; (c) Mechanical; or (d) Chemical.  \n\nLimestone should be cleaned by water and occasionally by steam, with or without mechanical aids.  \n\nBefore starting any maintenance repair and cleaning works, reference should be made to BS 8221-2 and BS 8221-1 respectively.  \n\n# TYPES OF RUBBLE WALLING  \n\nA. Random rubble  \n\nB. Squared uncoursed rubble  \n\nC. Squared rubble brought up to courses D. Squared coursed rubble  \n\n# SECTION 11  \n\n# TANKING  \n\n# GENERAL  \n\nDesign  \n\n11.1  \n\nSpecialist Contractor  \n\nThe design of tanking shall comply with BS 8102 - protection of structures against water from the ground.   \n\nFor sheet membrane tanking, the work shall be executed by the manufacturers' approved specialist contractor.  \n\n# MATERIALS  \n\nMastic asphalt 11.3  \n\nMastic asphalt for tanking shall comply with type T1097 to BS 6925 (lime stone aggregate). All mastic asphalt blocks delivered to site must",
    "source_id": "chunk_269",
    "tokens": 294,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_269",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-2b71fef6a12a02e161fe9546c00e2e08": {
    "content": "approved specialist contractor.  \n\n# MATERIALS  \n\nMastic asphalt 11.3  \n\nMastic asphalt for tanking shall comply with type T1097 to BS 6925 (lime stone aggregate). All mastic asphalt blocks delivered to site must bear legible markings of:  \n\n(a) the name or trade mark of the manufacturer; (b) the number and date of British Standard; and (c) the type of number, e.g. T1097 to BS 6925.  \n\nProprietary flexible 11.4 sheet membrane  \n\nProprietary flexible  sheet  membrane  shall  be  capable  of  accommodating unanticipated cracks of up to $0.6\\mathrm{mm}$ wide without losing its waterproofing properties, and the properties of the membrane in lap shear and lap peel shall not be less than $110\\mathrm{kN}/\\mathrm{m}^{2}$ and $3.3\\mathrm{kN}/\\mathrm{m}$ respectively at site condition, unless otherwise approved by the SO. Certificates together with complete test reports to substantiate that the materials supplied meet the requirements specified shall be submitted when the material is delivered to the Site.  \n\n# Liquid applied membrane  \n\n11.4A  \n\nLiquid applied, elastomeric waterproofing shall be made of a pitch modified polyurethane, and shall be submitted for approval by the SO. The membrane shall be capable of an elongation of not less than $400\\%$ to accommodate cracks up to $2\\mathrm{mm}$",
    "source_id": "chunk_270",
    "tokens": 307,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_270",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-9be9ca124ca4a8e8ec1d995d3969cf90": {
    "content": "omeric waterproofing shall be made of a pitch modified polyurethane, and shall be submitted for approval by the SO. The membrane shall be capable of an elongation of not less than $400\\%$ to accommodate cracks up to $2\\mathrm{mm}$ without losing its waterproofing properties, and its tensile strength shall exceed $1.6\\mathrm{N}/\\mathrm{mm}^{2}$ , and the tear resistance and adhesion strength shall not be less than $12\\mathrm{N/mm}$ and $2.6\\mathrm{N/mm}$ respectively at site condition, unless otherwise approved by the SO. It shall be applied in strict accordance with the manufacturer's instructions.  \n\nCementitious waterproofing  \n\n11.4B  \n\nCementitious waterproofing shall be compatible with host concrete and all surfaces and materials, including ancillary materials, in contact with the waterproofing system. The material shall be non-toxic. It shall suit the situation on which it is to be used.  \n\n# TESTING  \n\nTesting of mastic 11.5 asphalt  \n\nSampling and testing of mastic asphalt for composition and hardness number shall be carried out in accordance with BS 5284.  \n\nPrepare a bulk sample of not less than $6\\mathrm{kg}$ by selecting at random from not less than 8 blocks, breaking them and taking portions from the inner part of each block. Deliver samples to the Public Works Laboratories (PWL) for testing as directed by the SO. If the test results of the samples do not comply",
    "source_id": "chunk_271",
    "tokens": 308,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_271",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-d60a0d73921ea8ad37e8dc011f8d1b49": {
    "content": "from not less than 8 blocks, breaking them and taking portions from the inner part of each block. Deliver samples to the Public Works Laboratories (PWL) for testing as directed by the SO. If the test results of the samples do not comply with Tables 11.1 and 11.2, the SO shall reject the whole consignment from which the unacceptable samples have been selected, in which case the rejected consignment shall be removed from theSite.  \n\nTABLE 11.1 Composition by analysis of mastic asphalt: type T1097   \n\nTABLE 11.2 Hardness number at $25\\mathrm{^\\circC}$   \n\nTesting of membrane  \n\n11.6  \n\nSampling and testing of sheet membrane shall be agreed with the SO and the results shall comply with the properties given in Clause 11.4. If the samples do not comply with the required properties, the SO may reject the whole consignment from which the unacceptable samples have been taken, in which case the rejected consignment shall be removed from the Site.  \n\n# WORKMANSHIP  \n\nWorkmanship 11.7  \n\nThe work shall be carried out in accordance with BS 8102, BS 8000-0 and BS 8000- 4. Particular attention is drawn to the following before installation:  \n\n(a) The Works shall be supervised by a competent representative from the Contractor/manufacturer. Inspection  shall be carried out and written approval given by this representative for each and every stage of",
    "source_id": "chunk_272",
    "tokens": 298,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_272",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-6db56082f607286cd341b3f6868835f8": {
    "content": "4. Particular attention is drawn to the following before installation:  \n\n(a) The Works shall be supervised by a competent representative from the Contractor/manufacturer. Inspection  shall be carried out and written approval given by this representative for each and every stage of work, from the surface preparation to the completion of the protection coating. Formal approval for each and every stage of work as mentioned shall be carried out by the SO.   \n\n(b) The Works shall only be carried out after the concrete has been properly cured for at least 7 days.   \n\n(C) Shop drawings shall be produced by the Contractor/manufacturer showing construction details including those at angles, corners, construction joints, pipe intrusions, etc. for approval and all Works shall be carried out as per the approved shop drawings.  \n\nSurface preparation 11.8 for sheet membrane  \n\nSurfaces to which tanking is to be applied shall be level and free from irregularities such as ridges, dips, fins and concrete or mortar droppings. The horizontal surfaces of the concrete shall be given a wood-floated finish and be laid flat and true to allow the specified thickness of the sheet membrane to be applied uniformly. Where vertical concrete is very smooth and in order to provide a satisfactory key for the sheet membrane, the Contractor shall remove the surface laitance by wire brushing and apply an approved proprietary high bond primer. Do not use excessive mould oil in the vertical form.  \n\nSurface preparation 11.8A for liquid membrane  \n\nThe concrete blinding layer and",
    "source_id": "chunk_273",
    "tokens": 302,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_273",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-4b3799e1bd13b9673cb6edc05d47d2a7": {
    "content": "membrane, the Contractor shall remove the surface laitance by wire brushing and apply an approved proprietary high bond primer. Do not use excessive mould oil in the vertical form.  \n\nSurface preparation 11.8A for liquid membrane  \n\nThe concrete blinding layer and basement wall should be properly cured. All surfaces to be waterproofed should be clean, sound, smooth, dry and free of cracks, void and roughness, which may interfere the adhesion between the substrate and the waterproofing membrane. Porous concrete or other absorbent surfaces should be sealed and all surface defects revealed after the inspection should be repaired by appropriate method as recommended by the manufacturer prior to installation of basecoat.  \n\nAll critical right angle bends must have a cant strip or fillet installed prior to application. At vertical termination, $20\\mathrm{~x~}20\\mathrm{~mm}$ recess groove should be formed for the waterproofing membrane to be tucked into.  \n\nRemelting mastic 11.9 asphalt on Site  \n\nBreak the blocks into pieces of suitable size, carefully stack in an approved cauldron or mechanical mixer and gradually heat to a temperature at no time exceeding $230^{\\mathrm{o}}\\mathrm{C}$ Whilst heating, agitate the asphalt continuously to prevent local overheating. Remove the asphalt from the cauldron or mixer by means of buckets which have been coated with a fine inert dust or cement. Do not use ashes or oil for this purpose.  \n\nThe Contractor shall check with suitable thermometers to ensure that the asphalt is heated to",
    "source_id": "chunk_274",
    "tokens": 309,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_274",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-fc44293e2ae95b0f5c87992c8fd9992c": {
    "content": "from the cauldron or mixer by means of buckets which have been coated with a fine inert dust or cement. Do not use ashes or oil for this purpose.  \n\nThe Contractor shall check with suitable thermometers to ensure that the asphalt is heated to the correct temperature.  \n\nTo ensure proper heating and mixing, take samples during the remelting process for the composition and the hardness number tests.  \n\nLaying of mastic asphalt  \n\n11.10  \n\nOn horizontal surfaces, mastic asphalt shall be laid in three coats to a total thickness of $30\\mathrm{mm}$ . On vertical surfaces, mastic asphalt shall be applied in three coats to a total thickness of not less than $20\\mathrm{mm}$ , taken to a height of at least $150\\mathrm{mm}$ above ground level. An angle fillet not less than $50\\mathrm{mm}$ wide shall be applied in two coats at the junction of two planes forming an internal angle. Joints in successive coats of mastic asphalt shall be staggered at least $150\\mathrm{mm}$ for horizontal work and $75\\mathrm{mm}$ for vertical work. The top of vertical mastic asphalt shall be tucked into a chase not less than $25\\times25\\mathrm{mm}$ unless the mastic asphalt is being continued horizontally.  \n\nSampling during laying of mastic asphalt  \n\n11.11  \n\nDuring laying, at least one sample shall be taken from the cauldron or mixer per day for control test.  \n\nSample prepared for",
    "source_id": "chunk_275",
    "tokens": 308,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_275",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-babeee72ddc7b3fab3398195400a5be2": {
    "content": "the mastic asphalt is being continued horizontally.  \n\nSampling during laying of mastic asphalt  \n\n11.11  \n\nDuring laying, at least one sample shall be taken from the cauldron or mixer per day for control test.  \n\nSample prepared for test shall not be less than $6\\mathrm{kg}$ by taking three increments, from the discharge of the mixer or from the middle of the cauldrons when approximately half of the charge remains. In the case of hand stirred cauldrons the molten material shall be thoroughly stirred immediately prior to the samples being taken. Thoroughly mix the three increments together in a clean, wide-mouthed galvanizediron bucket of approximate size $250\\mathrm{mm}$ dia. $\\mathrm{~x~}150\\mathrm{mm}$  \n\nPrepare two specimens for hardness number tests from the thoroughly mixed bulk sample as follows:  \n\n(a) Pour the mastic into two hardness moulds to a level slightly higher than the edge of the moulds;   \n\n(b) Tap with a spatula on the edge of the moulds for about 3 minutes so as to level the mastic and drive out entrapped air from the specimen; and   \n\n(c) Level off the surface with the spatula.  \n\nThe moulds and spatula shall be warmed before use.  \n\nPour bulk sample for testing composition into a wooden mould size $300\\mathrm{mm}$ $300\\:\\mathrm{mm}\\times25\\:\\mathrm{mm}$ deep.  \n\nThe composition and",
    "source_id": "chunk_276",
    "tokens": 305,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_276",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-c73a4e26353a52c669ce16dba7c469de": {
    "content": "s and spatula shall be warmed before use.  \n\nPour bulk sample for testing composition into a wooden mould size $300\\mathrm{mm}$ $300\\:\\mathrm{mm}\\times25\\:\\mathrm{mm}$ deep.  \n\nThe composition and hardness number of the samples shall comply with Tables 11.1 and 11.2. If the sample failed to comply, the work on site represented by the sample may have to be completely removed and redone.  \n\nLaying of 11.12   \n\nproprietary sheet   \n\nmembrane  \n\nProprietary flexible sheet membrane shall be primed, laid, lapped and finished in strict compliance with the manufacturer's recommendations.  \n\nBefore commencing the Works, the Contractor shall demonstrate on the Site that all adhesive and materials are fully compatible. No work shall be undertaken when the surface moisture exceeds the permissible, as tested by the moisture testing equipment on the Site. The spreading of adhesive over large areas resulting in setting before placing of membrane shall be forbidden.  Keep records of the adhesive used and check against the agreed spreading rate of membrane. Bubbles formed in the membrane shall be made good in accordance with the manufacturer's technical literature.  \n\n# Application of liquid 11.12A membrane  \n\nLiquid applied waterproofing membrane shall be applied in strict accordance with the manufacturer's instructions. It can be applied by roller, trowel or airless spray (only in well ventilated areas) in strict accordance with the manufacturer's specification and literature",
    "source_id": "chunk_277",
    "tokens": 295,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_277",
    "file_path": "custom_kg",
    "status": "processed"
  },
  "chunk-0a77d8eef4d7c740703a87efe0666586": {
    "content": "Liquid applied waterproofing membrane shall be applied in strict accordance with the manufacturer's instructions. It can be applied by roller, trowel or airless spray (only in well ventilated areas) in strict accordance with the manufacturer's specification and literature. Allow at least 24 hours of curing for the first coat before overcoating with the second coat. Allow another 24 hours minimum for curing before protection.  \n\n11.13  \n\nProtection of proprietary sheet membrane  \n\nApply protection within 2 working days on completion of each section of the Works. For horizontal work, the protection shall be a screed of cement and sand mortar $50\\mathrm{mm}$ in thickness. For ease of placing, this horizontal protection coating shall be very workable, slump of less than $100\\mathrm{mm}$ is not recommended. Temporary protection for the lapping area at the end of a working day shall be strictly in accordance with the manufacturer's recommendation. For vertical work, it shall be protected against damage by the erection of a masonry wall or protective boarding.  \n\nProtection of liquid 11.13A applied membrane  \n\nThe membrane must be protected from damage by future operations and other trades. Approved protection boards as recommended by the manufacturer shall be installed immediately after the membrane has cured.",
    "source_id": "chunk_278",
    "tokens": 251,
    "chunk_order_index": 0,
    "full_doc_id": "chunk_278",
    "file_path": "custom_kg",
    "status": "processed"
  }
}